{
  "metadata": {
    "total_articles": 240,
    "generation_date": "2025-12-02T00:03:23.286979",
    "date_range": {
      "start": "2025-11-02T01:03:23.277837",
      "end": "2025-12-01T21:03:23.277837"
    },
    "categories": {
      "Political": 40,
      "Economic": 40,
      "Social": 40,
      "Technological": 40,
      "Environmental": 40,
      "Legal": 40
    }
  },
  "articles": [
    {
      "article_id": "ART000081",
      "title": "Healthcare spending increases by 20%",
      "content": "The government allocated an additional 50 billion rupees to the healthcare sector in the supplementary budget. Industry experts believe this development will have significant implications for the sector. Stakeholders are closely monitoring the situation as implementation details emerge. The announcement comes amid broader efforts to address systemic challenges. Officials indicated that consultations with affected parties would continue. Further details are expected to be released in the coming weeks.",
      "summary": "The government allocated an additional 50 billion rupees to the healthcare sector in the supplementary budget.",
      "category": "Social",
      "source": "Newsfirst",
      "author": "News Desk",
      "published_at": "2025-11-02T01:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000081",
      "metadata": {
        "word_count": 68,
        "reading_time_minutes": 1,
        "has_images": true,
        "view_count": 1628
      }
    },
    {
      "article_id": "ART000162",
      "title": "Marine conservation zone expanded",
      "content": "The government designated an additional 15,000 square kilometers as a marine protected area. The initiative aligns with broader national development objectives outlined in recent planning documents. Funding arrangements have been secured through a combination of domestic resources and international partnerships. Key performance indicators will track impact and outcomes. Regional variations in implementation are expected. Public feedback mechanisms have been established. Preliminary results will be reviewed in six months.",
      "summary": "The government designated an additional 15,000 square kilometers as a marine protected area.",
      "category": "Environmental",
      "source": "Daily News",
      "author": "Special Correspondent",
      "published_at": "2025-11-02T03:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000162",
      "metadata": {
        "word_count": 68,
        "reading_time_minutes": 1,
        "has_images": false,
        "view_count": 1938
      }
    },
    {
      "article_id": "ART000001",
      "title": "Parliament debates new electoral reforms bill",
      "content": "The parliament convened today to discuss proposed reforms to the electoral system, with opposition parties raising concerns about implementation timelines. According to official statements, this represents a major policy shift. The decision follows extensive consultations with stakeholders and technical experts. Implementation will be phased over the next 12-18 months. Independent analysts have welcomed the move, noting its potential long-term benefits. Critics, however, raised concerns about execution capacity. A monitoring committee will oversee progress.",
      "summary": "The parliament convened today to discuss proposed reforms to the electoral system, with opposition parties raising concerns about implementation timelines.",
      "category": "Political",
      "source": "The Island",
      "author": "Political Editor",
      "published_at": "2025-11-02T04:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000001",
      "metadata": {
        "word_count": 73,
        "reading_time_minutes": 1,
        "has_images": false,
        "view_count": 4928
      }
    },
    {
      "article_id": "ART000122",
      "title": "5G network rollout begins in Colombo",
      "content": "Major telecommunications providers commenced 5G services in the capital with plans for nationwide coverage. The initiative aligns with broader national development objectives outlined in recent planning documents. Funding arrangements have been secured through a combination of domestic resources and international partnerships. Key performance indicators will track impact and outcomes. Regional variations in implementation are expected. Public feedback mechanisms have been established. Preliminary results will be reviewed in six months.",
      "summary": "Major telecommunications providers commenced 5G services in the capital with plans for nationwide coverage.",
      "category": "Technological",
      "source": "Daily News",
      "author": "Political Editor",
      "published_at": "2025-11-02T08:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000122",
      "metadata": {
        "word_count": 69,
        "reading_time_minutes": 1,
        "has_images": true,
        "view_count": 7684
      }
    },
    {
      "article_id": "ART000002",
      "title": "Government announces cabinet reshuffle",
      "content": "The President announced a major cabinet reshuffle affecting six ministries, citing the need for fresh perspectives in key portfolios. According to official statements, this represents a major policy shift. The decision follows extensive consultations with stakeholders and technical experts. Implementation will be phased over the next 12-18 months. Independent analysts have welcomed the move, noting its potential long-term benefits. Critics, however, raised concerns about execution capacity. A monitoring committee will oversee progress.",
      "summary": "The President announced a major cabinet reshuffle affecting six ministries, citing the need for fresh perspectives in key portfolios.",
      "category": "Political",
      "source": "Newsfirst",
      "author": "Field Reporter",
      "published_at": "2025-11-02T09:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000002",
      "metadata": {
        "word_count": 72,
        "reading_time_minutes": 1,
        "has_images": true,
        "view_count": 9047
      }
    },
    {
      "article_id": "ART000082",
      "title": "New education policy emphasizes STEM",
      "content": "The Ministry of Education unveiled a curriculum reform prioritizing science, technology, engineering, and mathematics. The initiative aligns with broader national development objectives outlined in recent planning documents. Funding arrangements have been secured through a combination of domestic resources and international partnerships. Key performance indicators will track impact and outcomes. Regional variations in implementation are expected. Public feedback mechanisms have been established. Preliminary results will be reviewed in six months.",
      "summary": "The Ministry of Education unveiled a curriculum reform prioritizing science, technology, engineering, and mathematics.",
      "category": "Social",
      "source": "Ada Derana",
      "author": "Political Editor",
      "published_at": "2025-11-02T11:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000082",
      "metadata": {
        "word_count": 69,
        "reading_time_minutes": 1,
        "has_images": true,
        "view_count": 2023
      }
    },
    {
      "article_id": "ART000042",
      "title": "Tourism revenue exceeds pre-pandemic levels",
      "content": "The tourism sector reported record earnings this quarter, surpassing 2019 figures for the first time since the pandemic. Observers note this development reflects evolving priorities in national policy. The announcement triggered varied reactions from different interest groups. Technical feasibility studies underpinned the decision-making process. Capacity building programs will support successful rollout. International best practices informed the design. Lessons learned from pilot projects were incorporated. Accountability frameworks ensure transparency.",
      "summary": "The tourism sector reported record earnings this quarter, surpassing 2019 figures for the first time since the pandemic.",
      "category": "Economic",
      "source": "The Island",
      "author": "Special Correspondent",
      "published_at": "2025-11-02T12:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000042",
      "metadata": {
        "word_count": 68,
        "reading_time_minutes": 1,
        "has_images": false,
        "view_count": 2784
      }
    },
    {
      "article_id": "ART000202",
      "title": "New data protection law enacted",
      "content": "Parliament passed comprehensive data privacy legislation aligned with international standards. Observers note this development reflects evolving priorities in national policy. The announcement triggered varied reactions from different interest groups. Technical feasibility studies underpinned the decision-making process. Capacity building programs will support successful rollout. International best practices informed the design. Lessons learned from pilot projects were incorporated. Accountability frameworks ensure transparency.",
      "summary": "Parliament passed comprehensive data privacy legislation aligned with international standards.",
      "category": "Legal",
      "source": "Newsfirst",
      "author": "Staff Reporter",
      "published_at": "2025-11-02T19:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000202",
      "metadata": {
        "word_count": 60,
        "reading_time_minutes": 1,
        "has_images": false,
        "view_count": 3773
      }
    },
    {
      "article_id": "ART000161",
      "title": "Renewable energy capacity reaches 45%",
      "content": "Sri Lanka achieved a milestone with 45% of electricity generation from renewable sources, mainly hydro and solar. According to official statements, this represents a major policy shift. The decision follows extensive consultations with stakeholders and technical experts. Implementation will be phased over the next 12-18 months. Independent analysts have welcomed the move, noting its potential long-term benefits. Critics, however, raised concerns about execution capacity. A monitoring committee will oversee progress.",
      "summary": "Sri Lanka achieved a milestone with 45% of electricity generation from renewable sources, mainly hydro and solar.",
      "category": "Environmental",
      "source": "Newsfirst",
      "author": "Special Correspondent",
      "published_at": "2025-11-02T21:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000161",
      "metadata": {
        "word_count": 70,
        "reading_time_minutes": 1,
        "has_images": false,
        "view_count": 2254
      }
    },
    {
      "article_id": "ART000201",
      "title": "Right to Information Act strengthened",
      "content": "Amendments to the RTI Act reduced response times and penalties for non-compliance by public officials. According to official statements, this represents a major policy shift. The decision follows extensive consultations with stakeholders and technical experts. Implementation will be phased over the next 12-18 months. Independent analysts have welcomed the move, noting its potential long-term benefits. Critics, however, raised concerns about execution capacity. A monitoring committee will oversee progress.",
      "summary": "Amendments to the RTI Act reduced response times and penalties for non-compliance by public officials.",
      "category": "Legal",
      "source": "Daily News",
      "author": "Economic Bureau",
      "published_at": "2025-11-02T22:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000201",
      "metadata": {
        "word_count": 68,
        "reading_time_minutes": 1,
        "has_images": false,
        "view_count": 6832
      }
    },
    {
      "article_id": "ART000041",
      "title": "Central Bank maintains interest rates",
      "content": "The Monetary Board decided to keep policy rates unchanged at 9.5%, citing stable inflation expectations. Observers note this development reflects evolving priorities in national policy. The announcement triggered varied reactions from different interest groups. Technical feasibility studies underpinned the decision-making process. Capacity building programs will support successful rollout. International best practices informed the design. Lessons learned from pilot projects were incorporated. Accountability frameworks ensure transparency.",
      "summary": "The Monetary Board decided to keep policy rates unchanged at 9.5%, citing stable inflation expectations.",
      "category": "Economic",
      "source": "Ada Derana",
      "author": "Political Editor",
      "published_at": "2025-11-02T23:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000041",
      "metadata": {
        "word_count": 65,
        "reading_time_minutes": 1,
        "has_images": true,
        "view_count": 3973
      }
    },
    {
      "article_id": "ART000121",
      "title": "National AI strategy released",
      "content": "The government unveiled a comprehensive artificial intelligence roadmap targeting healthcare, agriculture, and public services. The initiative aligns with broader national development objectives outlined in recent planning documents. Funding arrangements have been secured through a combination of domestic resources and international partnerships. Key performance indicators will track impact and outcomes. Regional variations in implementation are expected. Public feedback mechanisms have been established. Preliminary results will be reviewed in six months.",
      "summary": "The government unveiled a comprehensive artificial intelligence roadmap targeting healthcare, agriculture, and public services.",
      "category": "Technological",
      "source": "Colombo Gazette",
      "author": "Staff Reporter",
      "published_at": "2025-11-02T23:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000121",
      "metadata": {
        "word_count": 69,
        "reading_time_minutes": 1,
        "has_images": true,
        "view_count": 5330
      }
    },
    {
      "article_id": "ART000203",
      "title": "Judicial system digitization accelerated",
      "content": "Courts rolled out e-filing and virtual hearing capabilities in 15 districts. The initiative aligns with broader national development objectives outlined in recent planning documents. Funding arrangements have been secured through a combination of domestic resources and international partnerships. Key performance indicators will track impact and outcomes. Regional variations in implementation are expected. Public feedback mechanisms have been established. Preliminary results will be reviewed in six months.",
      "summary": "Courts rolled out e-filing and virtual hearing capabilities in 15 districts.",
      "category": "Legal",
      "source": "The Island",
      "author": "Political Editor",
      "published_at": "2025-11-03T09:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000203",
      "metadata": {
        "word_count": 66,
        "reading_time_minutes": 1,
        "has_images": true,
        "view_count": 8331
      }
    },
    {
      "article_id": "ART000083",
      "title": "Unemployment rate falls to 4.8%",
      "content": "The Department of Census and Statistics reported the unemployment rate declined for the third consecutive quarter. The initiative aligns with broader national development objectives outlined in recent planning documents. Funding arrangements have been secured through a combination of domestic resources and international partnerships. Key performance indicators will track impact and outcomes. Regional variations in implementation are expected. Public feedback mechanisms have been established. Preliminary results will be reviewed in six months.",
      "summary": "The Department of Census and Statistics reported the unemployment rate declined for the third consecutive quarter.",
      "category": "Social",
      "source": "Ada Derana",
      "author": "News Desk",
      "published_at": "2025-11-03T10:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000083",
      "metadata": {
        "word_count": 71,
        "reading_time_minutes": 1,
        "has_images": true,
        "view_count": 6326
      }
    },
    {
      "article_id": "ART000123",
      "title": "Cybersecurity law enacted",
      "content": "Parliament passed the Cybersecurity Act providing a legal framework for protecting critical information infrastructure. Industry experts believe this development will have significant implications for the sector. Stakeholders are closely monitoring the situation as implementation details emerge. The announcement comes amid broader efforts to address systemic challenges. Officials indicated that consultations with affected parties would continue. Further details are expected to be released in the coming weeks.",
      "summary": "Parliament passed the Cybersecurity Act providing a legal framework for protecting critical information infrastructure.",
      "category": "Technological",
      "source": "Daily News",
      "author": "Special Correspondent",
      "published_at": "2025-11-03T13:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000123",
      "metadata": {
        "word_count": 66,
        "reading_time_minutes": 1,
        "has_images": false,
        "view_count": 4861
      }
    },
    {
      "article_id": "ART000003",
      "title": "Opposition calls for no-confidence motion",
      "content": "Opposition parties have submitted a no-confidence motion against the Minister of Finance, criticizing recent economic policies. Observers note this development reflects evolving priorities in national policy. The announcement triggered varied reactions from different interest groups. Technical feasibility studies underpinned the decision-making process. Capacity building programs will support successful rollout. International best practices informed the design. Lessons learned from pilot projects were incorporated. Accountability frameworks ensure transparency.",
      "summary": "Opposition parties have submitted a no-confidence motion against the Minister of Finance, criticizing recent economic policies.",
      "category": "Political",
      "source": "The Island",
      "author": "Political Editor",
      "published_at": "2025-11-03T17:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000003",
      "metadata": {
        "word_count": 66,
        "reading_time_minutes": 1,
        "has_images": true,
        "view_count": 816
      }
    },
    {
      "article_id": "ART000163",
      "title": "Plastic ban extended to single-use products",
      "content": "Environmental regulations now prohibit 15 categories of single-use plastics nationwide. Observers note this development reflects evolving priorities in national policy. The announcement triggered varied reactions from different interest groups. Technical feasibility studies underpinned the decision-making process. Capacity building programs will support successful rollout. International best practices informed the design. Lessons learned from pilot projects were incorporated. Accountability frameworks ensure transparency.",
      "summary": "Environmental regulations now prohibit 15 categories of single-use plastics nationwide.",
      "category": "Environmental",
      "source": "Daily News",
      "author": "Political Editor",
      "published_at": "2025-11-03T21:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000163",
      "metadata": {
        "word_count": 60,
        "reading_time_minutes": 1,
        "has_images": true,
        "view_count": 3298
      }
    },
    {
      "article_id": "ART000043",
      "title": "Stock market reaches 12-month high",
      "content": "The Colombo Stock Exchange All Share Price Index closed at a 12-month peak, driven by banking sector gains. The initiative aligns with broader national development objectives outlined in recent planning documents. Funding arrangements have been secured through a combination of domestic resources and international partnerships. Key performance indicators will track impact and outcomes. Regional variations in implementation are expected. Public feedback mechanisms have been established. Preliminary results will be reviewed in six months.",
      "summary": "The Colombo Stock Exchange All Share Price Index closed at a 12-month peak, driven by banking sector gains.",
      "category": "Economic",
      "source": "Newsfirst",
      "author": "Field Reporter",
      "published_at": "2025-11-03T22:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000043",
      "metadata": {
        "word_count": 73,
        "reading_time_minutes": 1,
        "has_images": true,
        "view_count": 1420
      }
    },
    {
      "article_id": "ART000084",
      "title": "Housing development project launched",
      "content": "A public-private partnership will deliver 50,000 affordable housing units over the next three years. According to official statements, this represents a major policy shift. The decision follows extensive consultations with stakeholders and technical experts. Implementation will be phased over the next 12-18 months. Independent analysts have welcomed the move, noting its potential long-term benefits. Critics, however, raised concerns about execution capacity. A monitoring committee will oversee progress.",
      "summary": "A public-private partnership will deliver 50,000 affordable housing units over the next three years.",
      "category": "Social",
      "source": "Colombo Gazette",
      "author": "Field Reporter",
      "published_at": "2025-11-04T00:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000084",
      "metadata": {
        "word_count": 67,
        "reading_time_minutes": 1,
        "has_images": false,
        "view_count": 3529
      }
    },
    {
      "article_id": "ART000204",
      "title": "Competition law amended",
      "content": "The Competition Commission received enhanced powers to investigate anti-competitive practices. The initiative aligns with broader national development objectives outlined in recent planning documents. Funding arrangements have been secured through a combination of domestic resources and international partnerships. Key performance indicators will track impact and outcomes. Regional variations in implementation are expected. Public feedback mechanisms have been established. Preliminary results will be reviewed in six months.",
      "summary": "The Competition Commission received enhanced powers to investigate anti-competitive practices.",
      "category": "Legal",
      "source": "Daily News",
      "author": "News Desk",
      "published_at": "2025-11-04T01:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000204",
      "metadata": {
        "word_count": 65,
        "reading_time_minutes": 1,
        "has_images": true,
        "view_count": 4057
      }
    },
    {
      "article_id": "ART000124",
      "title": "Digital payment adoption reaches 60%",
      "content": "Mobile payment transactions grew 85% year-on-year as cashless adoption accelerated across demographics. According to official statements, this represents a major policy shift. The decision follows extensive consultations with stakeholders and technical experts. Implementation will be phased over the next 12-18 months. Independent analysts have welcomed the move, noting its potential long-term benefits. Critics, however, raised concerns about execution capacity. A monitoring committee will oversee progress.",
      "summary": "Mobile payment transactions grew 85% year-on-year as cashless adoption accelerated across demographics.",
      "category": "Technological",
      "source": "The Island",
      "author": "Staff Reporter",
      "published_at": "2025-11-04T04:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000124",
      "metadata": {
        "word_count": 65,
        "reading_time_minutes": 1,
        "has_images": true,
        "view_count": 5153
      }
    },
    {
      "article_id": "ART000164",
      "title": "Climate adaptation fund receives $200M",
      "content": "International climate finance commitments will support coastal resilience and agriculture adaptation projects. The initiative aligns with broader national development objectives outlined in recent planning documents. Funding arrangements have been secured through a combination of domestic resources and international partnerships. Key performance indicators will track impact and outcomes. Regional variations in implementation are expected. Public feedback mechanisms have been established. Preliminary results will be reviewed in six months.",
      "summary": "International climate finance commitments will support coastal resilience and agriculture adaptation projects.",
      "category": "Environmental",
      "source": "Ada Derana",
      "author": "Field Reporter",
      "published_at": "2025-11-04T07:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000164",
      "metadata": {
        "word_count": 67,
        "reading_time_minutes": 1,
        "has_images": true,
        "view_count": 3038
      }
    },
    {
      "article_id": "ART000004",
      "title": "New diplomatic ties established with neighboring countries",
      "content": "Sri Lanka signed bilateral agreements with three regional partners, focusing on trade and security cooperation. Observers note this development reflects evolving priorities in national policy. The announcement triggered varied reactions from different interest groups. Technical feasibility studies underpinned the decision-making process. Capacity building programs will support successful rollout. International best practices informed the design. Lessons learned from pilot projects were incorporated. Accountability frameworks ensure transparency.",
      "summary": "Sri Lanka signed bilateral agreements with three regional partners, focusing on trade and security cooperation.",
      "category": "Political",
      "source": "Hiru News",
      "author": "Special Correspondent",
      "published_at": "2025-11-04T13:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000004",
      "metadata": {
        "word_count": 65,
        "reading_time_minutes": 1,
        "has_images": false,
        "view_count": 673
      }
    },
    {
      "article_id": "ART000044",
      "title": "Foreign reserves increase by $500 million",
      "content": "The Central Bank reported gross official reserves rose to $4.2 billion, reflecting improved external position. Observers note this development reflects evolving priorities in national policy. The announcement triggered varied reactions from different interest groups. Technical feasibility studies underpinned the decision-making process. Capacity building programs will support successful rollout. International best practices informed the design. Lessons learned from pilot projects were incorporated. Accountability frameworks ensure transparency.",
      "summary": "The Central Bank reported gross official reserves rose to $4.2 billion, reflecting improved external position.",
      "category": "Economic",
      "source": "Daily News",
      "author": "Political Editor",
      "published_at": "2025-11-04T17:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000044",
      "metadata": {
        "word_count": 65,
        "reading_time_minutes": 1,
        "has_images": false,
        "view_count": 7591
      }
    },
    {
      "article_id": "ART000165",
      "title": "Deforestation rate drops by 30%",
      "content": "Satellite monitoring showed forest cover increased due to reforestation initiatives and enforcement. The initiative aligns with broader national development objectives outlined in recent planning documents. Funding arrangements have been secured through a combination of domestic resources and international partnerships. Key performance indicators will track impact and outcomes. Regional variations in implementation are expected. Public feedback mechanisms have been established. Preliminary results will be reviewed in six months.",
      "summary": "Satellite monitoring showed forest cover increased due to reforestation initiatives and enforcement.",
      "category": "Environmental",
      "source": "The Island",
      "author": "Staff Reporter",
      "published_at": "2025-11-05T01:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000165",
      "metadata": {
        "word_count": 67,
        "reading_time_minutes": 1,
        "has_images": false,
        "view_count": 8972
      }
    },
    {
      "article_id": "ART000206",
      "title": "Intellectual property regime updated",
      "content": "Patent and trademark laws were harmonized with international treaties to support innovation. Industry experts believe this development will have significant implications for the sector. Stakeholders are closely monitoring the situation as implementation details emerge. The announcement comes amid broader efforts to address systemic challenges. Officials indicated that consultations with affected parties would continue. Further details are expected to be released in the coming weeks.",
      "summary": "Patent and trademark laws were harmonized with international treaties to support innovation.",
      "category": "Legal",
      "source": "Newsfirst",
      "author": "Special Correspondent",
      "published_at": "2025-11-05T03:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000206",
      "metadata": {
        "word_count": 64,
        "reading_time_minutes": 1,
        "has_images": true,
        "view_count": 2934
      }
    },
    {
      "article_id": "ART000205",
      "title": "Labor law reforms approved",
      "content": "Amendments to labor legislation introduced flexible work arrangements and strengthened worker protections. According to official statements, this represents a major policy shift. The decision follows extensive consultations with stakeholders and technical experts. Implementation will be phased over the next 12-18 months. Independent analysts have welcomed the move, noting its potential long-term benefits. Critics, however, raised concerns about execution capacity. A monitoring committee will oversee progress.",
      "summary": "Amendments to labor legislation introduced flexible work arrangements and strengthened worker protections.",
      "category": "Legal",
      "source": "The Island",
      "author": "Staff Reporter",
      "published_at": "2025-11-05T04:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000205",
      "metadata": {
        "word_count": 65,
        "reading_time_minutes": 1,
        "has_images": true,
        "view_count": 1180
      }
    },
    {
      "article_id": "ART000006",
      "title": "Anti-corruption commission launches probe",
      "content": "The Commission to Investigate Allegations of Bribery or Corruption initiated investigations into several high-profile cases. The initiative aligns with broader national development objectives outlined in recent planning documents. Funding arrangements have been secured through a combination of domestic resources and international partnerships. Key performance indicators will track impact and outcomes. Regional variations in implementation are expected. Public feedback mechanisms have been established. Preliminary results will be reviewed in six months.",
      "summary": "The Commission to Investigate Allegations of Bribery or Corruption initiated investigations into several high-profile cases.",
      "category": "Political",
      "source": "Ada Derana",
      "author": "Special Correspondent",
      "published_at": "2025-11-05T06:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000006",
      "metadata": {
        "word_count": 70,
        "reading_time_minutes": 1,
        "has_images": false,
        "view_count": 177
      }
    },
    {
      "article_id": "ART000125",
      "title": "Tech startup ecosystem attracts $100M investment",
      "content": "Venture capital funding into Sri Lankan startups reached a record high, focusing on fintech and edtech. Industry experts believe this development will have significant implications for the sector. Stakeholders are closely monitoring the situation as implementation details emerge. The announcement comes amid broader efforts to address systemic challenges. Officials indicated that consultations with affected parties would continue. Further details are expected to be released in the coming weeks.",
      "summary": "Venture capital funding into Sri Lankan startups reached a record high, focusing on fintech and edtech.",
      "category": "Technological",
      "source": "Colombo Gazette",
      "author": "Special Correspondent",
      "published_at": "2025-11-05T06:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000125",
      "metadata": {
        "word_count": 68,
        "reading_time_minutes": 1,
        "has_images": true,
        "view_count": 335
      }
    },
    {
      "article_id": "ART000046",
      "title": "Export earnings grow 15% year-on-year",
      "content": "Merchandise exports reached $1.8 billion last month, with strong performance in textiles and IT services. According to official statements, this represents a major policy shift. The decision follows extensive consultations with stakeholders and technical experts. Implementation will be phased over the next 12-18 months. Independent analysts have welcomed the move, noting its potential long-term benefits. Critics, however, raised concerns about execution capacity. A monitoring committee will oversee progress.",
      "summary": "Merchandise exports reached $1.8 billion last month, with strong performance in textiles and IT services.",
      "category": "Economic",
      "source": "Hiru News",
      "author": "News Desk",
      "published_at": "2025-11-05T08:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000046",
      "metadata": {
        "word_count": 68,
        "reading_time_minutes": 1,
        "has_images": true,
        "view_count": 8644
      }
    },
    {
      "article_id": "ART000005",
      "title": "Provincial council elections postponed",
      "content": "The Election Commission announced a delay in provincial council elections due to pending legal challenges. Industry experts believe this development will have significant implications for the sector. Stakeholders are closely monitoring the situation as implementation details emerge. The announcement comes amid broader efforts to address systemic challenges. Officials indicated that consultations with affected parties would continue. Further details are expected to be released in the coming weeks.",
      "summary": "The Election Commission announced a delay in provincial council elections due to pending legal challenges.",
      "category": "Political",
      "source": "Newsfirst",
      "author": "Political Editor",
      "published_at": "2025-11-05T09:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000005",
      "metadata": {
        "word_count": 67,
        "reading_time_minutes": 1,
        "has_images": false,
        "view_count": 7225
      }
    },
    {
      "article_id": "ART000085",
      "title": "Poverty alleviation program expanded",
      "content": "The Samurdhi welfare program coverage was extended to an additional 200,000 families in rural areas. The initiative aligns with broader national development objectives outlined in recent planning documents. Funding arrangements have been secured through a combination of domestic resources and international partnerships. Key performance indicators will track impact and outcomes. Regional variations in implementation are expected. Public feedback mechanisms have been established. Preliminary results will be reviewed in six months.",
      "summary": "The Samurdhi welfare program coverage was extended to an additional 200,000 families in rural areas.",
      "category": "Social",
      "source": "The Island",
      "author": "Field Reporter",
      "published_at": "2025-11-05T12:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000085",
      "metadata": {
        "word_count": 70,
        "reading_time_minutes": 1,
        "has_images": true,
        "view_count": 1642
      }
    },
    {
      "article_id": "ART000166",
      "title": "Electric vehicle adoption exceeds targets",
      "content": "Electric vehicle registrations surpassed 50,000, ahead of government projections for the year. Industry experts believe this development will have significant implications for the sector. Stakeholders are closely monitoring the situation as implementation details emerge. The announcement comes amid broader efforts to address systemic challenges. Officials indicated that consultations with affected parties would continue. Further details are expected to be released in the coming weeks.",
      "summary": "Electric vehicle registrations surpassed 50,000, ahead of government projections for the year.",
      "category": "Environmental",
      "source": "Newsfirst",
      "author": "News Desk",
      "published_at": "2025-11-05T17:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000166",
      "metadata": {
        "word_count": 64,
        "reading_time_minutes": 1,
        "has_images": true,
        "view_count": 9190
      }
    },
    {
      "article_id": "ART000045",
      "title": "Government unveils tax reform package",
      "content": "The Finance Ministry announced comprehensive tax reforms aimed at broadening the revenue base and reducing compliance costs. According to official statements, this represents a major policy shift. The decision follows extensive consultations with stakeholders and technical experts. Implementation will be phased over the next 12-18 months. Independent analysts have welcomed the move, noting its potential long-term benefits. Critics, however, raised concerns about execution capacity. A monitoring committee will oversee progress.",
      "summary": "The Finance Ministry announced comprehensive tax reforms aimed at broadening the revenue base and reducing compliance costs.",
      "category": "Economic",
      "source": "Hiru News",
      "author": "News Desk",
      "published_at": "2025-11-05T21:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000045",
      "metadata": {
        "word_count": 70,
        "reading_time_minutes": 1,
        "has_images": false,
        "view_count": 7356
      }
    },
    {
      "article_id": "ART000126",
      "title": "Smart city pilot launched in Kandy",
      "content": "An IoT-enabled urban management system was deployed covering traffic, waste, and energy management. Observers note this development reflects evolving priorities in national policy. The announcement triggered varied reactions from different interest groups. Technical feasibility studies underpinned the decision-making process. Capacity building programs will support successful rollout. International best practices informed the design. Lessons learned from pilot projects were incorporated. Accountability frameworks ensure transparency.",
      "summary": "An IoT-enabled urban management system was deployed covering traffic, waste, and energy management.",
      "category": "Technological",
      "source": "Ada Derana",
      "author": "Economic Bureau",
      "published_at": "2025-11-05T22:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000126",
      "metadata": {
        "word_count": 63,
        "reading_time_minutes": 1,
        "has_images": false,
        "view_count": 9018
      }
    },
    {
      "article_id": "ART000086",
      "title": "Youth skills training initiative announced",
      "content": "A national skills development program will train 100,000 youth in digital and vocational skills. According to official statements, this represents a major policy shift. The decision follows extensive consultations with stakeholders and technical experts. Implementation will be phased over the next 12-18 months. Independent analysts have welcomed the move, noting its potential long-term benefits. Critics, however, raised concerns about execution capacity. A monitoring committee will oversee progress.",
      "summary": "A national skills development program will train 100,000 youth in digital and vocational skills.",
      "category": "Social",
      "source": "The Island",
      "author": "News Desk",
      "published_at": "2025-11-05T23:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000086",
      "metadata": {
        "word_count": 67,
        "reading_time_minutes": 1,
        "has_images": true,
        "view_count": 1172
      }
    },
    {
      "article_id": "ART000167",
      "title": "Water management project completed",
      "content": "A comprehensive watershed restoration program improved water security for 500,000 people. According to official statements, this represents a major policy shift. The decision follows extensive consultations with stakeholders and technical experts. Implementation will be phased over the next 12-18 months. Independent analysts have welcomed the move, noting its potential long-term benefits. Critics, however, raised concerns about execution capacity. A monitoring committee will oversee progress.",
      "summary": "A comprehensive watershed restoration program improved water security for 500,000 people.",
      "category": "Environmental",
      "source": "Ada Derana",
      "author": "Special Correspondent",
      "published_at": "2025-11-06T04:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000167",
      "metadata": {
        "word_count": 64,
        "reading_time_minutes": 1,
        "has_images": false,
        "view_count": 8627
      }
    },
    {
      "article_id": "ART000127",
      "title": "E-government services expanded",
      "content": "Citizens can now access 150 government services online through a unified digital platform. According to official statements, this represents a major policy shift. The decision follows extensive consultations with stakeholders and technical experts. Implementation will be phased over the next 12-18 months. Independent analysts have welcomed the move, noting its potential long-term benefits. Critics, however, raised concerns about execution capacity. A monitoring committee will oversee progress.",
      "summary": "Citizens can now access 150 government services online through a unified digital platform.",
      "category": "Technological",
      "source": "Newsfirst",
      "author": "News Desk",
      "published_at": "2025-11-06T09:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000127",
      "metadata": {
        "word_count": 66,
        "reading_time_minutes": 1,
        "has_images": true,
        "view_count": 9584
      }
    },
    {
      "article_id": "ART000047",
      "title": "Inflation rate drops to single digits",
      "content": "Consumer price inflation moderated to 8.9% in the latest reading, down from double digits earlier this year. According to official statements, this represents a major policy shift. The decision follows extensive consultations with stakeholders and technical experts. Implementation will be phased over the next 12-18 months. Independent analysts have welcomed the move, noting its potential long-term benefits. Critics, however, raised concerns about execution capacity. A monitoring committee will oversee progress.",
      "summary": "Consumer price inflation moderated to 8.9% in the latest reading, down from double digits earlier this year.",
      "category": "Economic",
      "source": "Colombo Gazette",
      "author": "Staff Reporter",
      "published_at": "2025-11-06T10:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000047",
      "metadata": {
        "word_count": 70,
        "reading_time_minutes": 1,
        "has_images": true,
        "view_count": 7332
      }
    },
    {
      "article_id": "ART000207",
      "title": "Environmental compliance penalties increased",
      "content": "New regulations imposed stricter fines for environmental violations by industrial facilities. The initiative aligns with broader national development objectives outlined in recent planning documents. Funding arrangements have been secured through a combination of domestic resources and international partnerships. Key performance indicators will track impact and outcomes. Regional variations in implementation are expected. Public feedback mechanisms have been established. Preliminary results will be reviewed in six months.",
      "summary": "New regulations imposed stricter fines for environmental violations by industrial facilities.",
      "category": "Legal",
      "source": "The Island",
      "author": "Special Correspondent",
      "published_at": "2025-11-06T12:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000207",
      "metadata": {
        "word_count": 66,
        "reading_time_minutes": 1,
        "has_images": true,
        "view_count": 4584
      }
    },
    {
      "article_id": "ART000007",
      "title": "Parliament passes constitutional amendment",
      "content": "A landmark constitutional amendment was passed with a two-thirds majority, strengthening parliamentary oversight. According to official statements, this represents a major policy shift. The decision follows extensive consultations with stakeholders and technical experts. Implementation will be phased over the next 12-18 months. Independent analysts have welcomed the move, noting its potential long-term benefits. Critics, however, raised concerns about execution capacity. A monitoring committee will oversee progress.",
      "summary": "A landmark constitutional amendment was passed with a two-thirds majority, strengthening parliamentary oversight.",
      "category": "Political",
      "source": "Newsfirst",
      "author": "Field Reporter",
      "published_at": "2025-11-06T16:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000007",
      "metadata": {
        "word_count": 66,
        "reading_time_minutes": 1,
        "has_images": false,
        "view_count": 3483
      }
    },
    {
      "article_id": "ART000087",
      "title": "Public health campaign targets malnutrition",
      "content": "The Ministry of Health launched a comprehensive nutrition intervention targeting children under five. Industry experts believe this development will have significant implications for the sector. Stakeholders are closely monitoring the situation as implementation details emerge. The announcement comes amid broader efforts to address systemic challenges. Officials indicated that consultations with affected parties would continue. Further details are expected to be released in the coming weeks.",
      "summary": "The Ministry of Health launched a comprehensive nutrition intervention targeting children under five.",
      "category": "Social",
      "source": "Newsfirst",
      "author": "Economic Bureau",
      "published_at": "2025-11-06T17:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000087",
      "metadata": {
        "word_count": 65,
        "reading_time_minutes": 1,
        "has_images": false,
        "view_count": 7222
      }
    },
    {
      "article_id": "ART000048",
      "title": "Credit rating agency upgrades outlook",
      "content": "International rating agency Moody's revised Sri Lanka's outlook from negative to stable, citing fiscal consolidation. According to official statements, this represents a major policy shift. The decision follows extensive consultations with stakeholders and technical experts. Implementation will be phased over the next 12-18 months. Independent analysts have welcomed the move, noting its potential long-term benefits. Critics, however, raised concerns about execution capacity. A monitoring committee will oversee progress.",
      "summary": "International rating agency Moody's revised Sri Lanka's outlook from negative to stable, citing fiscal consolidation.",
      "category": "Economic",
      "source": "Hiru News",
      "author": "Political Editor",
      "published_at": "2025-11-07T02:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000048",
      "metadata": {
        "word_count": 68,
        "reading_time_minutes": 1,
        "has_images": true,
        "view_count": 4670
      }
    },
    {
      "article_id": "ART000088",
      "title": "Gender equality index shows improvement",
      "content": "Sri Lanka moved up five places in the global gender gap index, driven by educational parity gains. The initiative aligns with broader national development objectives outlined in recent planning documents. Funding arrangements have been secured through a combination of domestic resources and international partnerships. Key performance indicators will track impact and outcomes. Regional variations in implementation are expected. Public feedback mechanisms have been established. Preliminary results will be reviewed in six months.",
      "summary": "Sri Lanka moved up five places in the global gender gap index, driven by educational parity gains.",
      "category": "Social",
      "source": "Newsfirst",
      "author": "News Desk",
      "published_at": "2025-11-07T03:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000088",
      "metadata": {
        "word_count": 72,
        "reading_time_minutes": 1,
        "has_images": false,
        "view_count": 934
      }
    },
    {
      "article_id": "ART000008",
      "title": "Political parties form coalition for upcoming elections",
      "content": "Five political parties announced a coalition agreement ahead of general elections scheduled for next year. Observers note this development reflects evolving priorities in national policy. The announcement triggered varied reactions from different interest groups. Technical feasibility studies underpinned the decision-making process. Capacity building programs will support successful rollout. International best practices informed the design. Lessons learned from pilot projects were incorporated. Accountability frameworks ensure transparency.",
      "summary": "Five political parties announced a coalition agreement ahead of general elections scheduled for next year.",
      "category": "Political",
      "source": "Newsfirst",
      "author": "Staff Reporter",
      "published_at": "2025-11-07T11:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000008",
      "metadata": {
        "word_count": 65,
        "reading_time_minutes": 1,
        "has_images": true,
        "view_count": 8655
      }
    },
    {
      "article_id": "ART000128",
      "title": "Research institute develops local AI model",
      "content": "Scientists at a national research center created a Sinhala and Tamil language processing model. According to official statements, this represents a major policy shift. The decision follows extensive consultations with stakeholders and technical experts. Implementation will be phased over the next 12-18 months. Independent analysts have welcomed the move, noting its potential long-term benefits. Critics, however, raised concerns about execution capacity. A monitoring committee will oversee progress.",
      "summary": "Scientists at a national research center created a Sinhala and Tamil language processing model.",
      "category": "Technological",
      "source": "Ada Derana",
      "author": "Special Correspondent",
      "published_at": "2025-11-07T12:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000128",
      "metadata": {
        "word_count": 67,
        "reading_time_minutes": 1,
        "has_images": false,
        "view_count": 2987
      }
    },
    {
      "article_id": "ART000208",
      "title": "Consumer protection bureau established",
      "content": "A dedicated authority was created to address consumer complaints and enforce fair trading practices. Observers note this development reflects evolving priorities in national policy. The announcement triggered varied reactions from different interest groups. Technical feasibility studies underpinned the decision-making process. Capacity building programs will support successful rollout. International best practices informed the design. Lessons learned from pilot projects were incorporated. Accountability frameworks ensure transparency.",
      "summary": "A dedicated authority was created to address consumer complaints and enforce fair trading practices.",
      "category": "Legal",
      "source": "Colombo Gazette",
      "author": "Field Reporter",
      "published_at": "2025-11-07T13:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000208",
      "metadata": {
        "word_count": 64,
        "reading_time_minutes": 1,
        "has_images": true,
        "view_count": 209
      }
    },
    {
      "article_id": "ART000168",
      "title": "Carbon neutrality roadmap announced",
      "content": "The government committed to achieving carbon neutrality by 2050 with interim targets for 2030. Observers note this development reflects evolving priorities in national policy. The announcement triggered varied reactions from different interest groups. Technical feasibility studies underpinned the decision-making process. Capacity building programs will support successful rollout. International best practices informed the design. Lessons learned from pilot projects were incorporated. Accountability frameworks ensure transparency.",
      "summary": "The government committed to achieving carbon neutrality by 2050 with interim targets for 2030.",
      "category": "Environmental",
      "source": "The Island",
      "author": "News Desk",
      "published_at": "2025-11-07T22:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000168",
      "metadata": {
        "word_count": 64,
        "reading_time_minutes": 1,
        "has_images": true,
        "view_count": 5168
      }
    },
    {
      "article_id": "ART000049",
      "title": "FDI inflows surge in manufacturing sector",
      "content": "Foreign direct investment in manufacturing increased by 45% in the first quarter, led by electronics assembly. The initiative aligns with broader national development objectives outlined in recent planning documents. Funding arrangements have been secured through a combination of domestic resources and international partnerships. Key performance indicators will track impact and outcomes. Regional variations in implementation are expected. Public feedback mechanisms have been established. Preliminary results will be reviewed in six months.",
      "summary": "Foreign direct investment in manufacturing increased by 45% in the first quarter, led by electronics assembly.",
      "category": "Economic",
      "source": "The Island",
      "author": "Political Editor",
      "published_at": "2025-11-08T01:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000049",
      "metadata": {
        "word_count": 71,
        "reading_time_minutes": 1,
        "has_images": false,
        "view_count": 4281
      }
    },
    {
      "article_id": "ART000130",
      "title": "National broadband policy targets 95% coverage",
      "content": "A policy framework aims to provide high-speed internet access to 95% of households by 2026. Industry experts believe this development will have significant implications for the sector. Stakeholders are closely monitoring the situation as implementation details emerge. The announcement comes amid broader efforts to address systemic challenges. Officials indicated that consultations with affected parties would continue. Further details are expected to be released in the coming weeks.",
      "summary": "A policy framework aims to provide high-speed internet access to 95% of households by 2026.",
      "category": "Technological",
      "source": "Newsfirst",
      "author": "Special Correspondent",
      "published_at": "2025-11-08T01:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000130",
      "metadata": {
        "word_count": 67,
        "reading_time_minutes": 1,
        "has_images": true,
        "view_count": 7070
      }
    },
    {
      "article_id": "ART000090",
      "title": "Social security net strengthened",
      "content": "The government expanded pension coverage to include informal sector workers in a phased rollout. The initiative aligns with broader national development objectives outlined in recent planning documents. Funding arrangements have been secured through a combination of domestic resources and international partnerships. Key performance indicators will track impact and outcomes. Regional variations in implementation are expected. Public feedback mechanisms have been established. Preliminary results will be reviewed in six months.",
      "summary": "The government expanded pension coverage to include informal sector workers in a phased rollout.",
      "category": "Social",
      "source": "Hiru News",
      "author": "Special Correspondent",
      "published_at": "2025-11-08T03:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000090",
      "metadata": {
        "word_count": 69,
        "reading_time_minutes": 1,
        "has_images": true,
        "view_count": 6755
      }
    },
    {
      "article_id": "ART000129",
      "title": "Blockchain pilot for land registry",
      "content": "The Land Registry Department initiated a blockchain-based property registration system in select districts. According to official statements, this represents a major policy shift. The decision follows extensive consultations with stakeholders and technical experts. Implementation will be phased over the next 12-18 months. Independent analysts have welcomed the move, noting its potential long-term benefits. Critics, however, raised concerns about execution capacity. A monitoring committee will oversee progress.",
      "summary": "The Land Registry Department initiated a blockchain-based property registration system in select districts.",
      "category": "Technological",
      "source": "Colombo Gazette",
      "author": "Special Correspondent",
      "published_at": "2025-11-08T11:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000129",
      "metadata": {
        "word_count": 66,
        "reading_time_minutes": 1,
        "has_images": false,
        "view_count": 3538
      }
    },
    {
      "article_id": "ART000089",
      "title": "Rural connectivity project connects 500 villages",
      "content": "A telecommunications infrastructure project brought 4G coverage to remote communities. Industry experts believe this development will have significant implications for the sector. Stakeholders are closely monitoring the situation as implementation details emerge. The announcement comes amid broader efforts to address systemic challenges. Officials indicated that consultations with affected parties would continue. Further details are expected to be released in the coming weeks.",
      "summary": "A telecommunications infrastructure project brought 4G coverage to remote communities.",
      "category": "Social",
      "source": "Hiru News",
      "author": "Special Correspondent",
      "published_at": "2025-11-08T13:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000089",
      "metadata": {
        "word_count": 62,
        "reading_time_minutes": 1,
        "has_images": false,
        "view_count": 7265
      }
    },
    {
      "article_id": "ART000050",
      "title": "Colombo Port handles record container volumes",
      "content": "The Port of Colombo processed 1.8 million TEUs last quarter, marking a 12% increase from the previous year. Industry experts believe this development will have significant implications for the sector. Stakeholders are closely monitoring the situation as implementation details emerge. The announcement comes amid broader efforts to address systemic challenges. Officials indicated that consultations with affected parties would continue. Further details are expected to be released in the coming weeks.",
      "summary": "The Port of Colombo processed 1.8 million TEUs last quarter, marking a 12% increase from the previous year.",
      "category": "Economic",
      "source": "Colombo Gazette",
      "author": "Political Editor",
      "published_at": "2025-11-08T16:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000050",
      "metadata": {
        "word_count": 70,
        "reading_time_minutes": 1,
        "has_images": true,
        "view_count": 3694
      }
    },
    {
      "article_id": "ART000009",
      "title": "Government approves decentralization policy",
      "content": "Cabinet approved a new policy framework for fiscal decentralization to provincial administrations. Observers note this development reflects evolving priorities in national policy. The announcement triggered varied reactions from different interest groups. Technical feasibility studies underpinned the decision-making process. Capacity building programs will support successful rollout. International best practices informed the design. Lessons learned from pilot projects were incorporated. Accountability frameworks ensure transparency.",
      "summary": "Cabinet approved a new policy framework for fiscal decentralization to provincial administrations.",
      "category": "Political",
      "source": "Daily News",
      "author": "Special Correspondent",
      "published_at": "2025-11-08T17:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000009",
      "metadata": {
        "word_count": 62,
        "reading_time_minutes": 1,
        "has_images": true,
        "view_count": 6481
      }
    },
    {
      "article_id": "ART000010",
      "title": "Supreme Court rules on executive powers",
      "content": "The Supreme Court delivered a judgment clarifying the limits of executive authority in provincial governance. Industry experts believe this development will have significant implications for the sector. Stakeholders are closely monitoring the situation as implementation details emerge. The announcement comes amid broader efforts to address systemic challenges. Officials indicated that consultations with affected parties would continue. Further details are expected to be released in the coming weeks.",
      "summary": "The Supreme Court delivered a judgment clarifying the limits of executive authority in provincial governance.",
      "category": "Political",
      "source": "Hiru News",
      "author": "Special Correspondent",
      "published_at": "2025-11-08T17:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000010",
      "metadata": {
        "word_count": 67,
        "reading_time_minutes": 1,
        "has_images": true,
        "view_count": 8431
      }
    },
    {
      "article_id": "ART000170",
      "title": "Air quality monitoring network expanded",
      "content": "Real-time air quality sensors were installed in 25 cities to track pollution levels. Observers note this development reflects evolving priorities in national policy. The announcement triggered varied reactions from different interest groups. Technical feasibility studies underpinned the decision-making process. Capacity building programs will support successful rollout. International best practices informed the design. Lessons learned from pilot projects were incorporated. Accountability frameworks ensure transparency.",
      "summary": "Real-time air quality sensors were installed in 25 cities to track pollution levels.",
      "category": "Environmental",
      "source": "Daily News",
      "author": "Field Reporter",
      "published_at": "2025-11-08T19:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000170",
      "metadata": {
        "word_count": 63,
        "reading_time_minutes": 1,
        "has_images": false,
        "view_count": 210
      }
    },
    {
      "article_id": "ART000169",
      "title": "Wildlife corridor protection law passed",
      "content": "New legislation protects 12 critical wildlife corridors connecting national parks and reserves. According to official statements, this represents a major policy shift. The decision follows extensive consultations with stakeholders and technical experts. Implementation will be phased over the next 12-18 months. Independent analysts have welcomed the move, noting its potential long-term benefits. Critics, however, raised concerns about execution capacity. A monitoring committee will oversee progress.",
      "summary": "New legislation protects 12 critical wildlife corridors connecting national parks and reserves.",
      "category": "Environmental",
      "source": "Colombo Gazette",
      "author": "News Desk",
      "published_at": "2025-11-08T20:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000169",
      "metadata": {
        "word_count": 65,
        "reading_time_minutes": 1,
        "has_images": false,
        "view_count": 658
      }
    },
    {
      "article_id": "ART000209",
      "title": "Anti-money laundering framework strengthened",
      "content": "The Financial Intelligence Unit received additional resources and powers to combat financial crimes. The initiative aligns with broader national development objectives outlined in recent planning documents. Funding arrangements have been secured through a combination of domestic resources and international partnerships. Key performance indicators will track impact and outcomes. Regional variations in implementation are expected. Public feedback mechanisms have been established. Preliminary results will be reviewed in six months.",
      "summary": "The Financial Intelligence Unit received additional resources and powers to combat financial crimes.",
      "category": "Legal",
      "source": "Hiru News",
      "author": "News Desk",
      "published_at": "2025-11-08T20:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000209",
      "metadata": {
        "word_count": 68,
        "reading_time_minutes": 1,
        "has_images": true,
        "view_count": 9199
      }
    },
    {
      "article_id": "ART000210",
      "title": "Legal aid program expanded",
      "content": "Free legal services were extended to cover civil matters in addition to criminal defense. According to official statements, this represents a major policy shift. The decision follows extensive consultations with stakeholders and technical experts. Implementation will be phased over the next 12-18 months. Independent analysts have welcomed the move, noting its potential long-term benefits. Critics, however, raised concerns about execution capacity. A monitoring committee will oversee progress.",
      "summary": "Free legal services were extended to cover civil matters in addition to criminal defense.",
      "category": "Legal",
      "source": "Ada Derana",
      "author": "Field Reporter",
      "published_at": "2025-11-08T22:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000210",
      "metadata": {
        "word_count": 67,
        "reading_time_minutes": 1,
        "has_images": true,
        "view_count": 3986
      }
    },
    {
      "article_id": "ART000091",
      "title": "Healthcare spending increases by 20%",
      "content": "The government allocated an additional 50 billion rupees to the healthcare sector in the supplementary budget. The initiative aligns with broader national development objectives outlined in recent planning documents. Funding arrangements have been secured through a combination of domestic resources and international partnerships. Key performance indicators will track impact and outcomes. Regional variations in implementation are expected. Public feedback mechanisms have been established. Preliminary results will be reviewed in six months.",
      "summary": "The government allocated an additional 50 billion rupees to the healthcare sector in the supplementary budget.",
      "category": "Social",
      "source": "The Island",
      "author": "Special Correspondent",
      "published_at": "2025-11-09T08:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000091",
      "metadata": {
        "word_count": 71,
        "reading_time_minutes": 1,
        "has_images": true,
        "view_count": 411
      }
    },
    {
      "article_id": "ART000131",
      "title": "National AI strategy released",
      "content": "The government unveiled a comprehensive artificial intelligence roadmap targeting healthcare, agriculture, and public services. According to official statements, this represents a major policy shift. The decision follows extensive consultations with stakeholders and technical experts. Implementation will be phased over the next 12-18 months. Independent analysts have welcomed the move, noting its potential long-term benefits. Critics, however, raised concerns about execution capacity. A monitoring committee will oversee progress.",
      "summary": "The government unveiled a comprehensive artificial intelligence roadmap targeting healthcare, agriculture, and public services.",
      "category": "Technological",
      "source": "Colombo Gazette",
      "author": "Special Correspondent",
      "published_at": "2025-11-09T10:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000131",
      "metadata": {
        "word_count": 67,
        "reading_time_minutes": 1,
        "has_images": false,
        "view_count": 6717
      }
    },
    {
      "article_id": "ART000171",
      "title": "Renewable energy capacity reaches 45%",
      "content": "Sri Lanka achieved a milestone with 45% of electricity generation from renewable sources, mainly hydro and solar. According to official statements, this represents a major policy shift. The decision follows extensive consultations with stakeholders and technical experts. Implementation will be phased over the next 12-18 months. Independent analysts have welcomed the move, noting its potential long-term benefits. Critics, however, raised concerns about execution capacity. A monitoring committee will oversee progress.",
      "summary": "Sri Lanka achieved a milestone with 45% of electricity generation from renewable sources, mainly hydro and solar.",
      "category": "Environmental",
      "source": "Ada Derana",
      "author": "Special Correspondent",
      "published_at": "2025-11-09T11:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000171",
      "metadata": {
        "word_count": 70,
        "reading_time_minutes": 1,
        "has_images": false,
        "view_count": 6460
      }
    },
    {
      "article_id": "ART000051",
      "title": "Central Bank maintains interest rates",
      "content": "The Monetary Board decided to keep policy rates unchanged at 9.5%, citing stable inflation expectations. According to official statements, this represents a major policy shift. The decision follows extensive consultations with stakeholders and technical experts. Implementation will be phased over the next 12-18 months. Independent analysts have welcomed the move, noting its potential long-term benefits. Critics, however, raised concerns about execution capacity. A monitoring committee will oversee progress.",
      "summary": "The Monetary Board decided to keep policy rates unchanged at 9.5%, citing stable inflation expectations.",
      "category": "Economic",
      "source": "The Island",
      "author": "Political Editor",
      "published_at": "2025-11-09T14:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000051",
      "metadata": {
        "word_count": 68,
        "reading_time_minutes": 1,
        "has_images": true,
        "view_count": 5588
      }
    },
    {
      "article_id": "ART000011",
      "title": "Parliament debates new electoral reforms bill",
      "content": "The parliament convened today to discuss proposed reforms to the electoral system, with opposition parties raising concerns about implementation timelines. Observers note this development reflects evolving priorities in national policy. The announcement triggered varied reactions from different interest groups. Technical feasibility studies underpinned the decision-making process. Capacity building programs will support successful rollout. International best practices informed the design. Lessons learned from pilot projects were incorporated. Accountability frameworks ensure transparency.",
      "summary": "The parliament convened today to discuss proposed reforms to the electoral system, with opposition parties raising concerns about implementation timelines.",
      "category": "Political",
      "source": "Daily News",
      "author": "Economic Bureau",
      "published_at": "2025-11-09T17:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000011",
      "metadata": {
        "word_count": 70,
        "reading_time_minutes": 1,
        "has_images": true,
        "view_count": 4975
      }
    },
    {
      "article_id": "ART000211",
      "title": "Right to Information Act strengthened",
      "content": "Amendments to the RTI Act reduced response times and penalties for non-compliance by public officials. The initiative aligns with broader national development objectives outlined in recent planning documents. Funding arrangements have been secured through a combination of domestic resources and international partnerships. Key performance indicators will track impact and outcomes. Regional variations in implementation are expected. Public feedback mechanisms have been established. Preliminary results will be reviewed in six months.",
      "summary": "Amendments to the RTI Act reduced response times and penalties for non-compliance by public officials.",
      "category": "Legal",
      "source": "Daily News",
      "author": "Political Editor",
      "published_at": "2025-11-09T20:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000211",
      "metadata": {
        "word_count": 70,
        "reading_time_minutes": 1,
        "has_images": true,
        "view_count": 9001
      }
    },
    {
      "article_id": "ART000132",
      "title": "5G network rollout begins in Colombo",
      "content": "Major telecommunications providers commenced 5G services in the capital with plans for nationwide coverage. The initiative aligns with broader national development objectives outlined in recent planning documents. Funding arrangements have been secured through a combination of domestic resources and international partnerships. Key performance indicators will track impact and outcomes. Regional variations in implementation are expected. Public feedback mechanisms have been established. Preliminary results will be reviewed in six months.",
      "summary": "Major telecommunications providers commenced 5G services in the capital with plans for nationwide coverage.",
      "category": "Technological",
      "source": "Ada Derana",
      "author": "Political Editor",
      "published_at": "2025-11-10T07:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000132",
      "metadata": {
        "word_count": 69,
        "reading_time_minutes": 1,
        "has_images": true,
        "view_count": 2053
      }
    },
    {
      "article_id": "ART000172",
      "title": "Marine conservation zone expanded",
      "content": "The government designated an additional 15,000 square kilometers as a marine protected area. The initiative aligns with broader national development objectives outlined in recent planning documents. Funding arrangements have been secured through a combination of domestic resources and international partnerships. Key performance indicators will track impact and outcomes. Regional variations in implementation are expected. Public feedback mechanisms have been established. Preliminary results will be reviewed in six months.",
      "summary": "The government designated an additional 15,000 square kilometers as a marine protected area.",
      "category": "Environmental",
      "source": "Newsfirst",
      "author": "Field Reporter",
      "published_at": "2025-11-10T09:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000172",
      "metadata": {
        "word_count": 68,
        "reading_time_minutes": 1,
        "has_images": false,
        "view_count": 633
      }
    },
    {
      "article_id": "ART000052",
      "title": "Tourism revenue exceeds pre-pandemic levels",
      "content": "The tourism sector reported record earnings this quarter, surpassing 2019 figures for the first time since the pandemic. Observers note this development reflects evolving priorities in national policy. The announcement triggered varied reactions from different interest groups. Technical feasibility studies underpinned the decision-making process. Capacity building programs will support successful rollout. International best practices informed the design. Lessons learned from pilot projects were incorporated. Accountability frameworks ensure transparency.",
      "summary": "The tourism sector reported record earnings this quarter, surpassing 2019 figures for the first time since the pandemic.",
      "category": "Economic",
      "source": "Ada Derana",
      "author": "Staff Reporter",
      "published_at": "2025-11-10T12:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000052",
      "metadata": {
        "word_count": 68,
        "reading_time_minutes": 1,
        "has_images": true,
        "view_count": 6811
      }
    },
    {
      "article_id": "ART000092",
      "title": "New education policy emphasizes STEM",
      "content": "The Ministry of Education unveiled a curriculum reform prioritizing science, technology, engineering, and mathematics. Industry experts believe this development will have significant implications for the sector. Stakeholders are closely monitoring the situation as implementation details emerge. The announcement comes amid broader efforts to address systemic challenges. Officials indicated that consultations with affected parties would continue. Further details are expected to be released in the coming weeks.",
      "summary": "The Ministry of Education unveiled a curriculum reform prioritizing science, technology, engineering, and mathematics.",
      "category": "Social",
      "source": "Newsfirst",
      "author": "News Desk",
      "published_at": "2025-11-10T18:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000092",
      "metadata": {
        "word_count": 66,
        "reading_time_minutes": 1,
        "has_images": false,
        "view_count": 687
      }
    },
    {
      "article_id": "ART000212",
      "title": "New data protection law enacted",
      "content": "Parliament passed comprehensive data privacy legislation aligned with international standards. Observers note this development reflects evolving priorities in national policy. The announcement triggered varied reactions from different interest groups. Technical feasibility studies underpinned the decision-making process. Capacity building programs will support successful rollout. International best practices informed the design. Lessons learned from pilot projects were incorporated. Accountability frameworks ensure transparency.",
      "summary": "Parliament passed comprehensive data privacy legislation aligned with international standards.",
      "category": "Legal",
      "source": "Colombo Gazette",
      "author": "Field Reporter",
      "published_at": "2025-11-10T19:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000212",
      "metadata": {
        "word_count": 60,
        "reading_time_minutes": 1,
        "has_images": true,
        "view_count": 398
      }
    },
    {
      "article_id": "ART000012",
      "title": "Government announces cabinet reshuffle",
      "content": "The President announced a major cabinet reshuffle affecting six ministries, citing the need for fresh perspectives in key portfolios. Industry experts believe this development will have significant implications for the sector. Stakeholders are closely monitoring the situation as implementation details emerge. The announcement comes amid broader efforts to address systemic challenges. Officials indicated that consultations with affected parties would continue. Further details are expected to be released in the coming weeks.",
      "summary": "The President announced a major cabinet reshuffle affecting six ministries, citing the need for fresh perspectives in key portfolios.",
      "category": "Political",
      "source": "Ada Derana",
      "author": "Staff Reporter",
      "published_at": "2025-11-10T21:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000012",
      "metadata": {
        "word_count": 71,
        "reading_time_minutes": 1,
        "has_images": false,
        "view_count": 9371
      }
    },
    {
      "article_id": "ART000053",
      "title": "Stock market reaches 12-month high",
      "content": "The Colombo Stock Exchange All Share Price Index closed at a 12-month peak, driven by banking sector gains. Industry experts believe this development will have significant implications for the sector. Stakeholders are closely monitoring the situation as implementation details emerge. The announcement comes amid broader efforts to address systemic challenges. Officials indicated that consultations with affected parties would continue. Further details are expected to be released in the coming weeks.",
      "summary": "The Colombo Stock Exchange All Share Price Index closed at a 12-month peak, driven by banking sector gains.",
      "category": "Economic",
      "source": "Colombo Gazette",
      "author": "Field Reporter",
      "published_at": "2025-11-11T02:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000053",
      "metadata": {
        "word_count": 70,
        "reading_time_minutes": 1,
        "has_images": true,
        "view_count": 2966
      }
    },
    {
      "article_id": "ART000214",
      "title": "Competition law amended",
      "content": "The Competition Commission received enhanced powers to investigate anti-competitive practices. According to official statements, this represents a major policy shift. The decision follows extensive consultations with stakeholders and technical experts. Implementation will be phased over the next 12-18 months. Independent analysts have welcomed the move, noting its potential long-term benefits. Critics, however, raised concerns about execution capacity. A monitoring committee will oversee progress.",
      "summary": "The Competition Commission received enhanced powers to investigate anti-competitive practices.",
      "category": "Legal",
      "source": "Colombo Gazette",
      "author": "Field Reporter",
      "published_at": "2025-11-11T03:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000214",
      "metadata": {
        "word_count": 63,
        "reading_time_minutes": 1,
        "has_images": false,
        "view_count": 7937
      }
    },
    {
      "article_id": "ART000094",
      "title": "Housing development project launched",
      "content": "A public-private partnership will deliver 50,000 affordable housing units over the next three years. The initiative aligns with broader national development objectives outlined in recent planning documents. Funding arrangements have been secured through a combination of domestic resources and international partnerships. Key performance indicators will track impact and outcomes. Regional variations in implementation are expected. Public feedback mechanisms have been established. Preliminary results will be reviewed in six months.",
      "summary": "A public-private partnership will deliver 50,000 affordable housing units over the next three years.",
      "category": "Social",
      "source": "Ada Derana",
      "author": "Staff Reporter",
      "published_at": "2025-11-11T04:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000094",
      "metadata": {
        "word_count": 69,
        "reading_time_minutes": 1,
        "has_images": true,
        "view_count": 8735
      }
    },
    {
      "article_id": "ART000174",
      "title": "Climate adaptation fund receives $200M",
      "content": "International climate finance commitments will support coastal resilience and agriculture adaptation projects. Industry experts believe this development will have significant implications for the sector. Stakeholders are closely monitoring the situation as implementation details emerge. The announcement comes amid broader efforts to address systemic challenges. Officials indicated that consultations with affected parties would continue. Further details are expected to be released in the coming weeks.",
      "summary": "International climate finance commitments will support coastal resilience and agriculture adaptation projects.",
      "category": "Environmental",
      "source": "Newsfirst",
      "author": "News Desk",
      "published_at": "2025-11-11T09:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000174",
      "metadata": {
        "word_count": 64,
        "reading_time_minutes": 1,
        "has_images": true,
        "view_count": 9081
      }
    },
    {
      "article_id": "ART000133",
      "title": "Cybersecurity law enacted",
      "content": "Parliament passed the Cybersecurity Act providing a legal framework for protecting critical information infrastructure. Industry experts believe this development will have significant implications for the sector. Stakeholders are closely monitoring the situation as implementation details emerge. The announcement comes amid broader efforts to address systemic challenges. Officials indicated that consultations with affected parties would continue. Further details are expected to be released in the coming weeks.",
      "summary": "Parliament passed the Cybersecurity Act providing a legal framework for protecting critical information infrastructure.",
      "category": "Technological",
      "source": "The Island",
      "author": "Special Correspondent",
      "published_at": "2025-11-11T12:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000133",
      "metadata": {
        "word_count": 66,
        "reading_time_minutes": 1,
        "has_images": false,
        "view_count": 8610
      }
    },
    {
      "article_id": "ART000213",
      "title": "Judicial system digitization accelerated",
      "content": "Courts rolled out e-filing and virtual hearing capabilities in 15 districts. Industry experts believe this development will have significant implications for the sector. Stakeholders are closely monitoring the situation as implementation details emerge. The announcement comes amid broader efforts to address systemic challenges. Officials indicated that consultations with affected parties would continue. Further details are expected to be released in the coming weeks.",
      "summary": "Courts rolled out e-filing and virtual hearing capabilities in 15 districts.",
      "category": "Legal",
      "source": "Newsfirst",
      "author": "News Desk",
      "published_at": "2025-11-11T13:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000213",
      "metadata": {
        "word_count": 63,
        "reading_time_minutes": 1,
        "has_images": true,
        "view_count": 7179
      }
    },
    {
      "article_id": "ART000013",
      "title": "Opposition calls for no-confidence motion",
      "content": "Opposition parties have submitted a no-confidence motion against the Minister of Finance, criticizing recent economic policies. The initiative aligns with broader national development objectives outlined in recent planning documents. Funding arrangements have been secured through a combination of domestic resources and international partnerships. Key performance indicators will track impact and outcomes. Regional variations in implementation are expected. Public feedback mechanisms have been established. Preliminary results will be reviewed in six months.",
      "summary": "Opposition parties have submitted a no-confidence motion against the Minister of Finance, criticizing recent economic policies.",
      "category": "Political",
      "source": "The Island",
      "author": "Economic Bureau",
      "published_at": "2025-11-11T16:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000013",
      "metadata": {
        "word_count": 71,
        "reading_time_minutes": 1,
        "has_images": false,
        "view_count": 7428
      }
    },
    {
      "article_id": "ART000173",
      "title": "Plastic ban extended to single-use products",
      "content": "Environmental regulations now prohibit 15 categories of single-use plastics nationwide. The initiative aligns with broader national development objectives outlined in recent planning documents. Funding arrangements have been secured through a combination of domestic resources and international partnerships. Key performance indicators will track impact and outcomes. Regional variations in implementation are expected. Public feedback mechanisms have been established. Preliminary results will be reviewed in six months.",
      "summary": "Environmental regulations now prohibit 15 categories of single-use plastics nationwide.",
      "category": "Environmental",
      "source": "Hiru News",
      "author": "Staff Reporter",
      "published_at": "2025-11-11T19:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000173",
      "metadata": {
        "word_count": 65,
        "reading_time_minutes": 1,
        "has_images": true,
        "view_count": 2829
      }
    },
    {
      "article_id": "ART000014",
      "title": "New diplomatic ties established with neighboring countries",
      "content": "Sri Lanka signed bilateral agreements with three regional partners, focusing on trade and security cooperation. According to official statements, this represents a major policy shift. The decision follows extensive consultations with stakeholders and technical experts. Implementation will be phased over the next 12-18 months. Independent analysts have welcomed the move, noting its potential long-term benefits. Critics, however, raised concerns about execution capacity. A monitoring committee will oversee progress.",
      "summary": "Sri Lanka signed bilateral agreements with three regional partners, focusing on trade and security cooperation.",
      "category": "Political",
      "source": "Hiru News",
      "author": "Staff Reporter",
      "published_at": "2025-11-11T22:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000014",
      "metadata": {
        "word_count": 68,
        "reading_time_minutes": 1,
        "has_images": true,
        "view_count": 1246
      }
    },
    {
      "article_id": "ART000054",
      "title": "Foreign reserves increase by $500 million",
      "content": "The Central Bank reported gross official reserves rose to $4.2 billion, reflecting improved external position. Industry experts believe this development will have significant implications for the sector. Stakeholders are closely monitoring the situation as implementation details emerge. The announcement comes amid broader efforts to address systemic challenges. Officials indicated that consultations with affected parties would continue. Further details are expected to be released in the coming weeks.",
      "summary": "The Central Bank reported gross official reserves rose to $4.2 billion, reflecting improved external position.",
      "category": "Economic",
      "source": "The Island",
      "author": "Political Editor",
      "published_at": "2025-11-11T23:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000054",
      "metadata": {
        "word_count": 67,
        "reading_time_minutes": 1,
        "has_images": true,
        "view_count": 2452
      }
    },
    {
      "article_id": "ART000093",
      "title": "Unemployment rate falls to 4.8%",
      "content": "The Department of Census and Statistics reported the unemployment rate declined for the third consecutive quarter. Observers note this development reflects evolving priorities in national policy. The announcement triggered varied reactions from different interest groups. Technical feasibility studies underpinned the decision-making process. Capacity building programs will support successful rollout. International best practices informed the design. Lessons learned from pilot projects were incorporated. Accountability frameworks ensure transparency.",
      "summary": "The Department of Census and Statistics reported the unemployment rate declined for the third consecutive quarter.",
      "category": "Social",
      "source": "Colombo Gazette",
      "author": "Staff Reporter",
      "published_at": "2025-11-11T23:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000093",
      "metadata": {
        "word_count": 66,
        "reading_time_minutes": 1,
        "has_images": false,
        "view_count": 4333
      }
    },
    {
      "article_id": "ART000134",
      "title": "Digital payment adoption reaches 60%",
      "content": "Mobile payment transactions grew 85% year-on-year as cashless adoption accelerated across demographics. According to official statements, this represents a major policy shift. The decision follows extensive consultations with stakeholders and technical experts. Implementation will be phased over the next 12-18 months. Independent analysts have welcomed the move, noting its potential long-term benefits. Critics, however, raised concerns about execution capacity. A monitoring committee will oversee progress.",
      "summary": "Mobile payment transactions grew 85% year-on-year as cashless adoption accelerated across demographics.",
      "category": "Technological",
      "source": "Ada Derana",
      "author": "Special Correspondent",
      "published_at": "2025-11-11T23:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000134",
      "metadata": {
        "word_count": 65,
        "reading_time_minutes": 1,
        "has_images": false,
        "view_count": 7034
      }
    },
    {
      "article_id": "ART000015",
      "title": "Provincial council elections postponed",
      "content": "The Election Commission announced a delay in provincial council elections due to pending legal challenges. According to official statements, this represents a major policy shift. The decision follows extensive consultations with stakeholders and technical experts. Implementation will be phased over the next 12-18 months. Independent analysts have welcomed the move, noting its potential long-term benefits. Critics, however, raised concerns about execution capacity. A monitoring committee will oversee progress.",
      "summary": "The Election Commission announced a delay in provincial council elections due to pending legal challenges.",
      "category": "Political",
      "source": "Newsfirst",
      "author": "Political Editor",
      "published_at": "2025-11-12T02:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000015",
      "metadata": {
        "word_count": 68,
        "reading_time_minutes": 1,
        "has_images": true,
        "view_count": 214
      }
    },
    {
      "article_id": "ART000095",
      "title": "Poverty alleviation program expanded",
      "content": "The Samurdhi welfare program coverage was extended to an additional 200,000 families in rural areas. Observers note this development reflects evolving priorities in national policy. The announcement triggered varied reactions from different interest groups. Technical feasibility studies underpinned the decision-making process. Capacity building programs will support successful rollout. International best practices informed the design. Lessons learned from pilot projects were incorporated. Accountability frameworks ensure transparency.",
      "summary": "The Samurdhi welfare program coverage was extended to an additional 200,000 families in rural areas.",
      "category": "Social",
      "source": "Newsfirst",
      "author": "Staff Reporter",
      "published_at": "2025-11-12T06:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000095",
      "metadata": {
        "word_count": 65,
        "reading_time_minutes": 1,
        "has_images": false,
        "view_count": 454
      }
    },
    {
      "article_id": "ART000175",
      "title": "Deforestation rate drops by 30%",
      "content": "Satellite monitoring showed forest cover increased due to reforestation initiatives and enforcement. Observers note this development reflects evolving priorities in national policy. The announcement triggered varied reactions from different interest groups. Technical feasibility studies underpinned the decision-making process. Capacity building programs will support successful rollout. International best practices informed the design. Lessons learned from pilot projects were incorporated. Accountability frameworks ensure transparency.",
      "summary": "Satellite monitoring showed forest cover increased due to reforestation initiatives and enforcement.",
      "category": "Environmental",
      "source": "The Island",
      "author": "News Desk",
      "published_at": "2025-11-12T13:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000175",
      "metadata": {
        "word_count": 62,
        "reading_time_minutes": 1,
        "has_images": false,
        "view_count": 216
      }
    },
    {
      "article_id": "ART000055",
      "title": "Government unveils tax reform package",
      "content": "The Finance Ministry announced comprehensive tax reforms aimed at broadening the revenue base and reducing compliance costs. Industry experts believe this development will have significant implications for the sector. Stakeholders are closely monitoring the situation as implementation details emerge. The announcement comes amid broader efforts to address systemic challenges. Officials indicated that consultations with affected parties would continue. Further details are expected to be released in the coming weeks.",
      "summary": "The Finance Ministry announced comprehensive tax reforms aimed at broadening the revenue base and reducing compliance costs.",
      "category": "Economic",
      "source": "Daily News",
      "author": "News Desk",
      "published_at": "2025-11-12T14:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000055",
      "metadata": {
        "word_count": 69,
        "reading_time_minutes": 1,
        "has_images": true,
        "view_count": 2017
      }
    },
    {
      "article_id": "ART000215",
      "title": "Labor law reforms approved",
      "content": "Amendments to labor legislation introduced flexible work arrangements and strengthened worker protections. Industry experts believe this development will have significant implications for the sector. Stakeholders are closely monitoring the situation as implementation details emerge. The announcement comes amid broader efforts to address systemic challenges. Officials indicated that consultations with affected parties would continue. Further details are expected to be released in the coming weeks.",
      "summary": "Amendments to labor legislation introduced flexible work arrangements and strengthened worker protections.",
      "category": "Legal",
      "source": "Daily News",
      "author": "Field Reporter",
      "published_at": "2025-11-12T15:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000215",
      "metadata": {
        "word_count": 64,
        "reading_time_minutes": 1,
        "has_images": false,
        "view_count": 7206
      }
    },
    {
      "article_id": "ART000135",
      "title": "Tech startup ecosystem attracts $100M investment",
      "content": "Venture capital funding into Sri Lankan startups reached a record high, focusing on fintech and edtech. The initiative aligns with broader national development objectives outlined in recent planning documents. Funding arrangements have been secured through a combination of domestic resources and international partnerships. Key performance indicators will track impact and outcomes. Regional variations in implementation are expected. Public feedback mechanisms have been established. Preliminary results will be reviewed in six months.",
      "summary": "Venture capital funding into Sri Lankan startups reached a record high, focusing on fintech and edtech.",
      "category": "Technological",
      "source": "Colombo Gazette",
      "author": "News Desk",
      "published_at": "2025-11-12T20:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000135",
      "metadata": {
        "word_count": 71,
        "reading_time_minutes": 1,
        "has_images": false,
        "view_count": 8111
      }
    },
    {
      "article_id": "ART000016",
      "title": "Anti-corruption commission launches probe",
      "content": "The Commission to Investigate Allegations of Bribery or Corruption initiated investigations into several high-profile cases. Industry experts believe this development will have significant implications for the sector. Stakeholders are closely monitoring the situation as implementation details emerge. The announcement comes amid broader efforts to address systemic challenges. Officials indicated that consultations with affected parties would continue. Further details are expected to be released in the coming weeks.",
      "summary": "The Commission to Investigate Allegations of Bribery or Corruption initiated investigations into several high-profile cases.",
      "category": "Political",
      "source": "Colombo Gazette",
      "author": "Staff Reporter",
      "published_at": "2025-11-13T01:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000016",
      "metadata": {
        "word_count": 67,
        "reading_time_minutes": 1,
        "has_images": false,
        "view_count": 602
      }
    },
    {
      "article_id": "ART000136",
      "title": "Smart city pilot launched in Kandy",
      "content": "An IoT-enabled urban management system was deployed covering traffic, waste, and energy management. Observers note this development reflects evolving priorities in national policy. The announcement triggered varied reactions from different interest groups. Technical feasibility studies underpinned the decision-making process. Capacity building programs will support successful rollout. International best practices informed the design. Lessons learned from pilot projects were incorporated. Accountability frameworks ensure transparency.",
      "summary": "An IoT-enabled urban management system was deployed covering traffic, waste, and energy management.",
      "category": "Technological",
      "source": "Daily News",
      "author": "Economic Bureau",
      "published_at": "2025-11-13T04:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000136",
      "metadata": {
        "word_count": 63,
        "reading_time_minutes": 1,
        "has_images": false,
        "view_count": 1692
      }
    },
    {
      "article_id": "ART000056",
      "title": "Export earnings grow 15% year-on-year",
      "content": "Merchandise exports reached $1.8 billion last month, with strong performance in textiles and IT services. Observers note this development reflects evolving priorities in national policy. The announcement triggered varied reactions from different interest groups. Technical feasibility studies underpinned the decision-making process. Capacity building programs will support successful rollout. International best practices informed the design. Lessons learned from pilot projects were incorporated. Accountability frameworks ensure transparency.",
      "summary": "Merchandise exports reached $1.8 billion last month, with strong performance in textiles and IT services.",
      "category": "Economic",
      "source": "Ada Derana",
      "author": "Special Correspondent",
      "published_at": "2025-11-13T10:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000056",
      "metadata": {
        "word_count": 65,
        "reading_time_minutes": 1,
        "has_images": false,
        "view_count": 8702
      }
    },
    {
      "article_id": "ART000096",
      "title": "Youth skills training initiative announced",
      "content": "A national skills development program will train 100,000 youth in digital and vocational skills. The initiative aligns with broader national development objectives outlined in recent planning documents. Funding arrangements have been secured through a combination of domestic resources and international partnerships. Key performance indicators will track impact and outcomes. Regional variations in implementation are expected. Public feedback mechanisms have been established. Preliminary results will be reviewed in six months.",
      "summary": "A national skills development program will train 100,000 youth in digital and vocational skills.",
      "category": "Social",
      "source": "Hiru News",
      "author": "Economic Bureau",
      "published_at": "2025-11-13T12:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000096",
      "metadata": {
        "word_count": 69,
        "reading_time_minutes": 1,
        "has_images": false,
        "view_count": 3193
      }
    },
    {
      "article_id": "ART000176",
      "title": "Electric vehicle adoption exceeds targets",
      "content": "Electric vehicle registrations surpassed 50,000, ahead of government projections for the year. The initiative aligns with broader national development objectives outlined in recent planning documents. Funding arrangements have been secured through a combination of domestic resources and international partnerships. Key performance indicators will track impact and outcomes. Regional variations in implementation are expected. Public feedback mechanisms have been established. Preliminary results will be reviewed in six months.",
      "summary": "Electric vehicle registrations surpassed 50,000, ahead of government projections for the year.",
      "category": "Environmental",
      "source": "Ada Derana",
      "author": "Political Editor",
      "published_at": "2025-11-13T19:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000176",
      "metadata": {
        "word_count": 67,
        "reading_time_minutes": 1,
        "has_images": false,
        "view_count": 5833
      }
    },
    {
      "article_id": "ART000216",
      "title": "Intellectual property regime updated",
      "content": "Patent and trademark laws were harmonized with international treaties to support innovation. The initiative aligns with broader national development objectives outlined in recent planning documents. Funding arrangements have been secured through a combination of domestic resources and international partnerships. Key performance indicators will track impact and outcomes. Regional variations in implementation are expected. Public feedback mechanisms have been established. Preliminary results will be reviewed in six months.",
      "summary": "Patent and trademark laws were harmonized with international treaties to support innovation.",
      "category": "Legal",
      "source": "Newsfirst",
      "author": "News Desk",
      "published_at": "2025-11-13T22:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000216",
      "metadata": {
        "word_count": 67,
        "reading_time_minutes": 1,
        "has_images": false,
        "view_count": 6987
      }
    },
    {
      "article_id": "ART000097",
      "title": "Public health campaign targets malnutrition",
      "content": "The Ministry of Health launched a comprehensive nutrition intervention targeting children under five. Industry experts believe this development will have significant implications for the sector. Stakeholders are closely monitoring the situation as implementation details emerge. The announcement comes amid broader efforts to address systemic challenges. Officials indicated that consultations with affected parties would continue. Further details are expected to be released in the coming weeks.",
      "summary": "The Ministry of Health launched a comprehensive nutrition intervention targeting children under five.",
      "category": "Social",
      "source": "The Island",
      "author": "Special Correspondent",
      "published_at": "2025-11-14T00:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000097",
      "metadata": {
        "word_count": 65,
        "reading_time_minutes": 1,
        "has_images": false,
        "view_count": 198
      }
    },
    {
      "article_id": "ART000217",
      "title": "Environmental compliance penalties increased",
      "content": "New regulations imposed stricter fines for environmental violations by industrial facilities. The initiative aligns with broader national development objectives outlined in recent planning documents. Funding arrangements have been secured through a combination of domestic resources and international partnerships. Key performance indicators will track impact and outcomes. Regional variations in implementation are expected. Public feedback mechanisms have been established. Preliminary results will be reviewed in six months.",
      "summary": "New regulations imposed stricter fines for environmental violations by industrial facilities.",
      "category": "Legal",
      "source": "Hiru News",
      "author": "News Desk",
      "published_at": "2025-11-14T05:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000217",
      "metadata": {
        "word_count": 66,
        "reading_time_minutes": 1,
        "has_images": true,
        "view_count": 9163
      }
    },
    {
      "article_id": "ART000058",
      "title": "Credit rating agency upgrades outlook",
      "content": "International rating agency Moody's revised Sri Lanka's outlook from negative to stable, citing fiscal consolidation. The initiative aligns with broader national development objectives outlined in recent planning documents. Funding arrangements have been secured through a combination of domestic resources and international partnerships. Key performance indicators will track impact and outcomes. Regional variations in implementation are expected. Public feedback mechanisms have been established. Preliminary results will be reviewed in six months.",
      "summary": "International rating agency Moody's revised Sri Lanka's outlook from negative to stable, citing fiscal consolidation.",
      "category": "Economic",
      "source": "Newsfirst",
      "author": "Special Correspondent",
      "published_at": "2025-11-14T07:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000058",
      "metadata": {
        "word_count": 70,
        "reading_time_minutes": 1,
        "has_images": false,
        "view_count": 7975
      }
    },
    {
      "article_id": "ART000177",
      "title": "Water management project completed",
      "content": "A comprehensive watershed restoration program improved water security for 500,000 people. Industry experts believe this development will have significant implications for the sector. Stakeholders are closely monitoring the situation as implementation details emerge. The announcement comes amid broader efforts to address systemic challenges. Officials indicated that consultations with affected parties would continue. Further details are expected to be released in the coming weeks.",
      "summary": "A comprehensive watershed restoration program improved water security for 500,000 people.",
      "category": "Environmental",
      "source": "Hiru News",
      "author": "Economic Bureau",
      "published_at": "2025-11-14T07:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000177",
      "metadata": {
        "word_count": 63,
        "reading_time_minutes": 1,
        "has_images": true,
        "view_count": 688
      }
    },
    {
      "article_id": "ART000218",
      "title": "Consumer protection bureau established",
      "content": "A dedicated authority was created to address consumer complaints and enforce fair trading practices. Industry experts believe this development will have significant implications for the sector. Stakeholders are closely monitoring the situation as implementation details emerge. The announcement comes amid broader efforts to address systemic challenges. Officials indicated that consultations with affected parties would continue. Further details are expected to be released in the coming weeks.",
      "summary": "A dedicated authority was created to address consumer complaints and enforce fair trading practices.",
      "category": "Legal",
      "source": "Daily News",
      "author": "Economic Bureau",
      "published_at": "2025-11-14T07:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000218",
      "metadata": {
        "word_count": 66,
        "reading_time_minutes": 1,
        "has_images": true,
        "view_count": 7707
      }
    },
    {
      "article_id": "ART000017",
      "title": "Parliament passes constitutional amendment",
      "content": "A landmark constitutional amendment was passed with a two-thirds majority, strengthening parliamentary oversight. Observers note this development reflects evolving priorities in national policy. The announcement triggered varied reactions from different interest groups. Technical feasibility studies underpinned the decision-making process. Capacity building programs will support successful rollout. International best practices informed the design. Lessons learned from pilot projects were incorporated. Accountability frameworks ensure transparency.",
      "summary": "A landmark constitutional amendment was passed with a two-thirds majority, strengthening parliamentary oversight.",
      "category": "Political",
      "source": "The Island",
      "author": "Staff Reporter",
      "published_at": "2025-11-14T08:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000017",
      "metadata": {
        "word_count": 63,
        "reading_time_minutes": 1,
        "has_images": true,
        "view_count": 602
      }
    },
    {
      "article_id": "ART000178",
      "title": "Carbon neutrality roadmap announced",
      "content": "The government committed to achieving carbon neutrality by 2050 with interim targets for 2030. The initiative aligns with broader national development objectives outlined in recent planning documents. Funding arrangements have been secured through a combination of domestic resources and international partnerships. Key performance indicators will track impact and outcomes. Regional variations in implementation are expected. Public feedback mechanisms have been established. Preliminary results will be reviewed in six months.",
      "summary": "The government committed to achieving carbon neutrality by 2050 with interim targets for 2030.",
      "category": "Environmental",
      "source": "The Island",
      "author": "Economic Bureau",
      "published_at": "2025-11-14T09:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000178",
      "metadata": {
        "word_count": 69,
        "reading_time_minutes": 1,
        "has_images": true,
        "view_count": 2450
      }
    },
    {
      "article_id": "ART000138",
      "title": "Research institute develops local AI model",
      "content": "Scientists at a national research center created a Sinhala and Tamil language processing model. Observers note this development reflects evolving priorities in national policy. The announcement triggered varied reactions from different interest groups. Technical feasibility studies underpinned the decision-making process. Capacity building programs will support successful rollout. International best practices informed the design. Lessons learned from pilot projects were incorporated. Accountability frameworks ensure transparency.",
      "summary": "Scientists at a national research center created a Sinhala and Tamil language processing model.",
      "category": "Technological",
      "source": "The Island",
      "author": "Staff Reporter",
      "published_at": "2025-11-14T10:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000138",
      "metadata": {
        "word_count": 64,
        "reading_time_minutes": 1,
        "has_images": false,
        "view_count": 4035
      }
    },
    {
      "article_id": "ART000098",
      "title": "Gender equality index shows improvement",
      "content": "Sri Lanka moved up five places in the global gender gap index, driven by educational parity gains. Industry experts believe this development will have significant implications for the sector. Stakeholders are closely monitoring the situation as implementation details emerge. The announcement comes amid broader efforts to address systemic challenges. Officials indicated that consultations with affected parties would continue. Further details are expected to be released in the coming weeks.",
      "summary": "Sri Lanka moved up five places in the global gender gap index, driven by educational parity gains.",
      "category": "Social",
      "source": "Ada Derana",
      "author": "Staff Reporter",
      "published_at": "2025-11-14T11:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000098",
      "metadata": {
        "word_count": 69,
        "reading_time_minutes": 1,
        "has_images": false,
        "view_count": 6952
      }
    },
    {
      "article_id": "ART000137",
      "title": "E-government services expanded",
      "content": "Citizens can now access 150 government services online through a unified digital platform. According to official statements, this represents a major policy shift. The decision follows extensive consultations with stakeholders and technical experts. Implementation will be phased over the next 12-18 months. Independent analysts have welcomed the move, noting its potential long-term benefits. Critics, however, raised concerns about execution capacity. A monitoring committee will oversee progress.",
      "summary": "Citizens can now access 150 government services online through a unified digital platform.",
      "category": "Technological",
      "source": "Colombo Gazette",
      "author": "Field Reporter",
      "published_at": "2025-11-14T11:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000137",
      "metadata": {
        "word_count": 66,
        "reading_time_minutes": 1,
        "has_images": true,
        "view_count": 5176
      }
    },
    {
      "article_id": "ART000018",
      "title": "Political parties form coalition for upcoming elections",
      "content": "Five political parties announced a coalition agreement ahead of general elections scheduled for next year. Industry experts believe this development will have significant implications for the sector. Stakeholders are closely monitoring the situation as implementation details emerge. The announcement comes amid broader efforts to address systemic challenges. Officials indicated that consultations with affected parties would continue. Further details are expected to be released in the coming weeks.",
      "summary": "Five political parties announced a coalition agreement ahead of general elections scheduled for next year.",
      "category": "Political",
      "source": "The Island",
      "author": "Special Correspondent",
      "published_at": "2025-11-14T16:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000018",
      "metadata": {
        "word_count": 67,
        "reading_time_minutes": 1,
        "has_images": false,
        "view_count": 430
      }
    },
    {
      "article_id": "ART000057",
      "title": "Inflation rate drops to single digits",
      "content": "Consumer price inflation moderated to 8.9% in the latest reading, down from double digits earlier this year. Observers note this development reflects evolving priorities in national policy. The announcement triggered varied reactions from different interest groups. Technical feasibility studies underpinned the decision-making process. Capacity building programs will support successful rollout. International best practices informed the design. Lessons learned from pilot projects were incorporated. Accountability frameworks ensure transparency.",
      "summary": "Consumer price inflation moderated to 8.9% in the latest reading, down from double digits earlier this year.",
      "category": "Economic",
      "source": "Hiru News",
      "author": "Economic Bureau",
      "published_at": "2025-11-14T23:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000057",
      "metadata": {
        "word_count": 67,
        "reading_time_minutes": 1,
        "has_images": false,
        "view_count": 8143
      }
    },
    {
      "article_id": "ART000139",
      "title": "Blockchain pilot for land registry",
      "content": "The Land Registry Department initiated a blockchain-based property registration system in select districts. The initiative aligns with broader national development objectives outlined in recent planning documents. Funding arrangements have been secured through a combination of domestic resources and international partnerships. Key performance indicators will track impact and outcomes. Regional variations in implementation are expected. Public feedback mechanisms have been established. Preliminary results will be reviewed in six months.",
      "summary": "The Land Registry Department initiated a blockchain-based property registration system in select districts.",
      "category": "Technological",
      "source": "Hiru News",
      "author": "Field Reporter",
      "published_at": "2025-11-15T04:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000139",
      "metadata": {
        "word_count": 68,
        "reading_time_minutes": 1,
        "has_images": true,
        "view_count": 958
      }
    },
    {
      "article_id": "ART000179",
      "title": "Wildlife corridor protection law passed",
      "content": "New legislation protects 12 critical wildlife corridors connecting national parks and reserves. The initiative aligns with broader national development objectives outlined in recent planning documents. Funding arrangements have been secured through a combination of domestic resources and international partnerships. Key performance indicators will track impact and outcomes. Regional variations in implementation are expected. Public feedback mechanisms have been established. Preliminary results will be reviewed in six months.",
      "summary": "New legislation protects 12 critical wildlife corridors connecting national parks and reserves.",
      "category": "Environmental",
      "source": "Hiru News",
      "author": "Economic Bureau",
      "published_at": "2025-11-15T05:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000179",
      "metadata": {
        "word_count": 67,
        "reading_time_minutes": 1,
        "has_images": true,
        "view_count": 5138
      }
    },
    {
      "article_id": "ART000099",
      "title": "Rural connectivity project connects 500 villages",
      "content": "A telecommunications infrastructure project brought 4G coverage to remote communities. According to official statements, this represents a major policy shift. The decision follows extensive consultations with stakeholders and technical experts. Implementation will be phased over the next 12-18 months. Independent analysts have welcomed the move, noting its potential long-term benefits. Critics, however, raised concerns about execution capacity. A monitoring committee will oversee progress.",
      "summary": "A telecommunications infrastructure project brought 4G coverage to remote communities.",
      "category": "Social",
      "source": "Colombo Gazette",
      "author": "News Desk",
      "published_at": "2025-11-15T08:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000099",
      "metadata": {
        "word_count": 63,
        "reading_time_minutes": 1,
        "has_images": false,
        "view_count": 8785
      }
    },
    {
      "article_id": "ART000219",
      "title": "Anti-money laundering framework strengthened",
      "content": "The Financial Intelligence Unit received additional resources and powers to combat financial crimes. Observers note this development reflects evolving priorities in national policy. The announcement triggered varied reactions from different interest groups. Technical feasibility studies underpinned the decision-making process. Capacity building programs will support successful rollout. International best practices informed the design. Lessons learned from pilot projects were incorporated. Accountability frameworks ensure transparency.",
      "summary": "The Financial Intelligence Unit received additional resources and powers to combat financial crimes.",
      "category": "Legal",
      "source": "Colombo Gazette",
      "author": "Staff Reporter",
      "published_at": "2025-11-15T12:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000219",
      "metadata": {
        "word_count": 63,
        "reading_time_minutes": 1,
        "has_images": false,
        "view_count": 7577
      }
    },
    {
      "article_id": "ART000059",
      "title": "FDI inflows surge in manufacturing sector",
      "content": "Foreign direct investment in manufacturing increased by 45% in the first quarter, led by electronics assembly. According to official statements, this represents a major policy shift. The decision follows extensive consultations with stakeholders and technical experts. Implementation will be phased over the next 12-18 months. Independent analysts have welcomed the move, noting its potential long-term benefits. Critics, however, raised concerns about execution capacity. A monitoring committee will oversee progress.",
      "summary": "Foreign direct investment in manufacturing increased by 45% in the first quarter, led by electronics assembly.",
      "category": "Economic",
      "source": "The Island",
      "author": "Economic Bureau",
      "published_at": "2025-11-15T14:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000059",
      "metadata": {
        "word_count": 69,
        "reading_time_minutes": 1,
        "has_images": false,
        "view_count": 457
      }
    },
    {
      "article_id": "ART000019",
      "title": "Government approves decentralization policy",
      "content": "Cabinet approved a new policy framework for fiscal decentralization to provincial administrations. According to official statements, this represents a major policy shift. The decision follows extensive consultations with stakeholders and technical experts. Implementation will be phased over the next 12-18 months. Independent analysts have welcomed the move, noting its potential long-term benefits. Critics, however, raised concerns about execution capacity. A monitoring committee will oversee progress.",
      "summary": "Cabinet approved a new policy framework for fiscal decentralization to provincial administrations.",
      "category": "Political",
      "source": "Newsfirst",
      "author": "Special Correspondent",
      "published_at": "2025-11-15T22:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000019",
      "metadata": {
        "word_count": 65,
        "reading_time_minutes": 1,
        "has_images": true,
        "view_count": 217
      }
    },
    {
      "article_id": "ART000180",
      "title": "Air quality monitoring network expanded",
      "content": "Real-time air quality sensors were installed in 25 cities to track pollution levels. According to official statements, this represents a major policy shift. The decision follows extensive consultations with stakeholders and technical experts. Implementation will be phased over the next 12-18 months. Independent analysts have welcomed the move, noting its potential long-term benefits. Critics, however, raised concerns about execution capacity. A monitoring committee will oversee progress.",
      "summary": "Real-time air quality sensors were installed in 25 cities to track pollution levels.",
      "category": "Environmental",
      "source": "Daily News",
      "author": "Economic Bureau",
      "published_at": "2025-11-16T01:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000180",
      "metadata": {
        "word_count": 66,
        "reading_time_minutes": 1,
        "has_images": false,
        "view_count": 5707
      }
    },
    {
      "article_id": "ART000060",
      "title": "Colombo Port handles record container volumes",
      "content": "The Port of Colombo processed 1.8 million TEUs last quarter, marking a 12% increase from the previous year. According to official statements, this represents a major policy shift. The decision follows extensive consultations with stakeholders and technical experts. Implementation will be phased over the next 12-18 months. Independent analysts have welcomed the move, noting its potential long-term benefits. Critics, however, raised concerns about execution capacity. A monitoring committee will oversee progress.",
      "summary": "The Port of Colombo processed 1.8 million TEUs last quarter, marking a 12% increase from the previous year.",
      "category": "Economic",
      "source": "Newsfirst",
      "author": "News Desk",
      "published_at": "2025-11-16T08:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000060",
      "metadata": {
        "word_count": 71,
        "reading_time_minutes": 1,
        "has_images": true,
        "view_count": 2568
      }
    },
    {
      "article_id": "ART000100",
      "title": "Social security net strengthened",
      "content": "The government expanded pension coverage to include informal sector workers in a phased rollout. The initiative aligns with broader national development objectives outlined in recent planning documents. Funding arrangements have been secured through a combination of domestic resources and international partnerships. Key performance indicators will track impact and outcomes. Regional variations in implementation are expected. Public feedback mechanisms have been established. Preliminary results will be reviewed in six months.",
      "summary": "The government expanded pension coverage to include informal sector workers in a phased rollout.",
      "category": "Social",
      "source": "The Island",
      "author": "News Desk",
      "published_at": "2025-11-16T08:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000100",
      "metadata": {
        "word_count": 69,
        "reading_time_minutes": 1,
        "has_images": false,
        "view_count": 2049
      }
    },
    {
      "article_id": "ART000220",
      "title": "Legal aid program expanded",
      "content": "Free legal services were extended to cover civil matters in addition to criminal defense. According to official statements, this represents a major policy shift. The decision follows extensive consultations with stakeholders and technical experts. Implementation will be phased over the next 12-18 months. Independent analysts have welcomed the move, noting its potential long-term benefits. Critics, however, raised concerns about execution capacity. A monitoring committee will oversee progress.",
      "summary": "Free legal services were extended to cover civil matters in addition to criminal defense.",
      "category": "Legal",
      "source": "Ada Derana",
      "author": "News Desk",
      "published_at": "2025-11-16T10:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000220",
      "metadata": {
        "word_count": 67,
        "reading_time_minutes": 1,
        "has_images": true,
        "view_count": 5626
      }
    },
    {
      "article_id": "ART000140",
      "title": "National broadband policy targets 95% coverage",
      "content": "A policy framework aims to provide high-speed internet access to 95% of households by 2026. Industry experts believe this development will have significant implications for the sector. Stakeholders are closely monitoring the situation as implementation details emerge. The announcement comes amid broader efforts to address systemic challenges. Officials indicated that consultations with affected parties would continue. Further details are expected to be released in the coming weeks.",
      "summary": "A policy framework aims to provide high-speed internet access to 95% of households by 2026.",
      "category": "Technological",
      "source": "Colombo Gazette",
      "author": "News Desk",
      "published_at": "2025-11-16T12:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000140",
      "metadata": {
        "word_count": 67,
        "reading_time_minutes": 1,
        "has_images": false,
        "view_count": 1018
      }
    },
    {
      "article_id": "ART000020",
      "title": "Supreme Court rules on executive powers",
      "content": "The Supreme Court delivered a judgment clarifying the limits of executive authority in provincial governance. Observers note this development reflects evolving priorities in national policy. The announcement triggered varied reactions from different interest groups. Technical feasibility studies underpinned the decision-making process. Capacity building programs will support successful rollout. International best practices informed the design. Lessons learned from pilot projects were incorporated. Accountability frameworks ensure transparency.",
      "summary": "The Supreme Court delivered a judgment clarifying the limits of executive authority in provincial governance.",
      "category": "Political",
      "source": "Hiru News",
      "author": "Economic Bureau",
      "published_at": "2025-11-16T16:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000020",
      "metadata": {
        "word_count": 65,
        "reading_time_minutes": 1,
        "has_images": true,
        "view_count": 7626
      }
    },
    {
      "article_id": "ART000062",
      "title": "Tourism revenue exceeds pre-pandemic levels",
      "content": "The tourism sector reported record earnings this quarter, surpassing 2019 figures for the first time since the pandemic. Observers note this development reflects evolving priorities in national policy. The announcement triggered varied reactions from different interest groups. Technical feasibility studies underpinned the decision-making process. Capacity building programs will support successful rollout. International best practices informed the design. Lessons learned from pilot projects were incorporated. Accountability frameworks ensure transparency.",
      "summary": "The tourism sector reported record earnings this quarter, surpassing 2019 figures for the first time since the pandemic.",
      "category": "Economic",
      "source": "Newsfirst",
      "author": "Political Editor",
      "published_at": "2025-11-17T00:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000062",
      "metadata": {
        "word_count": 68,
        "reading_time_minutes": 1,
        "has_images": true,
        "view_count": 8684
      }
    },
    {
      "article_id": "ART000101",
      "title": "Healthcare spending increases by 20%",
      "content": "The government allocated an additional 50 billion rupees to the healthcare sector in the supplementary budget. Observers note this development reflects evolving priorities in national policy. The announcement triggered varied reactions from different interest groups. Technical feasibility studies underpinned the decision-making process. Capacity building programs will support successful rollout. International best practices informed the design. Lessons learned from pilot projects were incorporated. Accountability frameworks ensure transparency.",
      "summary": "The government allocated an additional 50 billion rupees to the healthcare sector in the supplementary budget.",
      "category": "Social",
      "source": "Colombo Gazette",
      "author": "Economic Bureau",
      "published_at": "2025-11-17T00:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000101",
      "metadata": {
        "word_count": 66,
        "reading_time_minutes": 1,
        "has_images": false,
        "view_count": 7993
      }
    },
    {
      "article_id": "ART000182",
      "title": "Marine conservation zone expanded",
      "content": "The government designated an additional 15,000 square kilometers as a marine protected area. Observers note this development reflects evolving priorities in national policy. The announcement triggered varied reactions from different interest groups. Technical feasibility studies underpinned the decision-making process. Capacity building programs will support successful rollout. International best practices informed the design. Lessons learned from pilot projects were incorporated. Accountability frameworks ensure transparency.",
      "summary": "The government designated an additional 15,000 square kilometers as a marine protected area.",
      "category": "Environmental",
      "source": "Hiru News",
      "author": "Economic Bureau",
      "published_at": "2025-11-17T01:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000182",
      "metadata": {
        "word_count": 63,
        "reading_time_minutes": 1,
        "has_images": false,
        "view_count": 5367
      }
    },
    {
      "article_id": "ART000022",
      "title": "Government announces cabinet reshuffle",
      "content": "The President announced a major cabinet reshuffle affecting six ministries, citing the need for fresh perspectives in key portfolios. Industry experts believe this development will have significant implications for the sector. Stakeholders are closely monitoring the situation as implementation details emerge. The announcement comes amid broader efforts to address systemic challenges. Officials indicated that consultations with affected parties would continue. Further details are expected to be released in the coming weeks.",
      "summary": "The President announced a major cabinet reshuffle affecting six ministries, citing the need for fresh perspectives in key portfolios.",
      "category": "Political",
      "source": "Ada Derana",
      "author": "Special Correspondent",
      "published_at": "2025-11-17T04:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000022",
      "metadata": {
        "word_count": 71,
        "reading_time_minutes": 1,
        "has_images": true,
        "view_count": 6870
      }
    },
    {
      "article_id": "ART000221",
      "title": "Right to Information Act strengthened",
      "content": "Amendments to the RTI Act reduced response times and penalties for non-compliance by public officials. Industry experts believe this development will have significant implications for the sector. Stakeholders are closely monitoring the situation as implementation details emerge. The announcement comes amid broader efforts to address systemic challenges. Officials indicated that consultations with affected parties would continue. Further details are expected to be released in the coming weeks.",
      "summary": "Amendments to the RTI Act reduced response times and penalties for non-compliance by public officials.",
      "category": "Legal",
      "source": "The Island",
      "author": "News Desk",
      "published_at": "2025-11-17T05:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000221",
      "metadata": {
        "word_count": 67,
        "reading_time_minutes": 1,
        "has_images": true,
        "view_count": 4209
      }
    },
    {
      "article_id": "ART000222",
      "title": "New data protection law enacted",
      "content": "Parliament passed comprehensive data privacy legislation aligned with international standards. Industry experts believe this development will have significant implications for the sector. Stakeholders are closely monitoring the situation as implementation details emerge. The announcement comes amid broader efforts to address systemic challenges. Officials indicated that consultations with affected parties would continue. Further details are expected to be released in the coming weeks.",
      "summary": "Parliament passed comprehensive data privacy legislation aligned with international standards.",
      "category": "Legal",
      "source": "The Island",
      "author": "Special Correspondent",
      "published_at": "2025-11-17T08:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000222",
      "metadata": {
        "word_count": 62,
        "reading_time_minutes": 1,
        "has_images": true,
        "view_count": 7663
      }
    },
    {
      "article_id": "ART000141",
      "title": "National AI strategy released",
      "content": "The government unveiled a comprehensive artificial intelligence roadmap targeting healthcare, agriculture, and public services. The initiative aligns with broader national development objectives outlined in recent planning documents. Funding arrangements have been secured through a combination of domestic resources and international partnerships. Key performance indicators will track impact and outcomes. Regional variations in implementation are expected. Public feedback mechanisms have been established. Preliminary results will be reviewed in six months.",
      "summary": "The government unveiled a comprehensive artificial intelligence roadmap targeting healthcare, agriculture, and public services.",
      "category": "Technological",
      "source": "Daily News",
      "author": "News Desk",
      "published_at": "2025-11-17T09:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000141",
      "metadata": {
        "word_count": 69,
        "reading_time_minutes": 1,
        "has_images": false,
        "view_count": 8911
      }
    },
    {
      "article_id": "ART000061",
      "title": "Central Bank maintains interest rates",
      "content": "The Monetary Board decided to keep policy rates unchanged at 9.5%, citing stable inflation expectations. The initiative aligns with broader national development objectives outlined in recent planning documents. Funding arrangements have been secured through a combination of domestic resources and international partnerships. Key performance indicators will track impact and outcomes. Regional variations in implementation are expected. Public feedback mechanisms have been established. Preliminary results will be reviewed in six months.",
      "summary": "The Monetary Board decided to keep policy rates unchanged at 9.5%, citing stable inflation expectations.",
      "category": "Economic",
      "source": "Daily News",
      "author": "News Desk",
      "published_at": "2025-11-17T11:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000061",
      "metadata": {
        "word_count": 70,
        "reading_time_minutes": 1,
        "has_images": false,
        "view_count": 384
      }
    },
    {
      "article_id": "ART000102",
      "title": "New education policy emphasizes STEM",
      "content": "The Ministry of Education unveiled a curriculum reform prioritizing science, technology, engineering, and mathematics. Observers note this development reflects evolving priorities in national policy. The announcement triggered varied reactions from different interest groups. Technical feasibility studies underpinned the decision-making process. Capacity building programs will support successful rollout. International best practices informed the design. Lessons learned from pilot projects were incorporated. Accountability frameworks ensure transparency.",
      "summary": "The Ministry of Education unveiled a curriculum reform prioritizing science, technology, engineering, and mathematics.",
      "category": "Social",
      "source": "Ada Derana",
      "author": "News Desk",
      "published_at": "2025-11-17T14:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000102",
      "metadata": {
        "word_count": 64,
        "reading_time_minutes": 1,
        "has_images": false,
        "view_count": 7188
      }
    },
    {
      "article_id": "ART000021",
      "title": "Parliament debates new electoral reforms bill",
      "content": "The parliament convened today to discuss proposed reforms to the electoral system, with opposition parties raising concerns about implementation timelines. According to official statements, this represents a major policy shift. The decision follows extensive consultations with stakeholders and technical experts. Implementation will be phased over the next 12-18 months. Independent analysts have welcomed the move, noting its potential long-term benefits. Critics, however, raised concerns about execution capacity. A monitoring committee will oversee progress.",
      "summary": "The parliament convened today to discuss proposed reforms to the electoral system, with opposition parties raising concerns about implementation timelines.",
      "category": "Political",
      "source": "Newsfirst",
      "author": "News Desk",
      "published_at": "2025-11-17T16:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000021",
      "metadata": {
        "word_count": 73,
        "reading_time_minutes": 1,
        "has_images": true,
        "view_count": 3972
      }
    },
    {
      "article_id": "ART000142",
      "title": "5G network rollout begins in Colombo",
      "content": "Major telecommunications providers commenced 5G services in the capital with plans for nationwide coverage. According to official statements, this represents a major policy shift. The decision follows extensive consultations with stakeholders and technical experts. Implementation will be phased over the next 12-18 months. Independent analysts have welcomed the move, noting its potential long-term benefits. Critics, however, raised concerns about execution capacity. A monitoring committee will oversee progress.",
      "summary": "Major telecommunications providers commenced 5G services in the capital with plans for nationwide coverage.",
      "category": "Technological",
      "source": "Ada Derana",
      "author": "Special Correspondent",
      "published_at": "2025-11-17T20:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000142",
      "metadata": {
        "word_count": 67,
        "reading_time_minutes": 1,
        "has_images": false,
        "view_count": 9579
      }
    },
    {
      "article_id": "ART000181",
      "title": "Renewable energy capacity reaches 45%",
      "content": "Sri Lanka achieved a milestone with 45% of electricity generation from renewable sources, mainly hydro and solar. Observers note this development reflects evolving priorities in national policy. The announcement triggered varied reactions from different interest groups. Technical feasibility studies underpinned the decision-making process. Capacity building programs will support successful rollout. International best practices informed the design. Lessons learned from pilot projects were incorporated. Accountability frameworks ensure transparency.",
      "summary": "Sri Lanka achieved a milestone with 45% of electricity generation from renewable sources, mainly hydro and solar.",
      "category": "Environmental",
      "source": "Colombo Gazette",
      "author": "Economic Bureau",
      "published_at": "2025-11-17T21:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000181",
      "metadata": {
        "word_count": 67,
        "reading_time_minutes": 1,
        "has_images": false,
        "view_count": 9490
      }
    },
    {
      "article_id": "ART000103",
      "title": "Unemployment rate falls to 4.8%",
      "content": "The Department of Census and Statistics reported the unemployment rate declined for the third consecutive quarter. Observers note this development reflects evolving priorities in national policy. The announcement triggered varied reactions from different interest groups. Technical feasibility studies underpinned the decision-making process. Capacity building programs will support successful rollout. International best practices informed the design. Lessons learned from pilot projects were incorporated. Accountability frameworks ensure transparency.",
      "summary": "The Department of Census and Statistics reported the unemployment rate declined for the third consecutive quarter.",
      "category": "Social",
      "source": "Hiru News",
      "author": "Field Reporter",
      "published_at": "2025-11-18T07:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000103",
      "metadata": {
        "word_count": 66,
        "reading_time_minutes": 1,
        "has_images": true,
        "view_count": 4510
      }
    },
    {
      "article_id": "ART000143",
      "title": "Cybersecurity law enacted",
      "content": "Parliament passed the Cybersecurity Act providing a legal framework for protecting critical information infrastructure. Observers note this development reflects evolving priorities in national policy. The announcement triggered varied reactions from different interest groups. Technical feasibility studies underpinned the decision-making process. Capacity building programs will support successful rollout. International best practices informed the design. Lessons learned from pilot projects were incorporated. Accountability frameworks ensure transparency.",
      "summary": "Parliament passed the Cybersecurity Act providing a legal framework for protecting critical information infrastructure.",
      "category": "Technological",
      "source": "Ada Derana",
      "author": "Economic Bureau",
      "published_at": "2025-11-18T08:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000143",
      "metadata": {
        "word_count": 64,
        "reading_time_minutes": 1,
        "has_images": true,
        "view_count": 5230
      }
    },
    {
      "article_id": "ART000023",
      "title": "Opposition calls for no-confidence motion",
      "content": "Opposition parties have submitted a no-confidence motion against the Minister of Finance, criticizing recent economic policies. Industry experts believe this development will have significant implications for the sector. Stakeholders are closely monitoring the situation as implementation details emerge. The announcement comes amid broader efforts to address systemic challenges. Officials indicated that consultations with affected parties would continue. Further details are expected to be released in the coming weeks.",
      "summary": "Opposition parties have submitted a no-confidence motion against the Minister of Finance, criticizing recent economic policies.",
      "category": "Political",
      "source": "Colombo Gazette",
      "author": "Political Editor",
      "published_at": "2025-11-18T16:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000023",
      "metadata": {
        "word_count": 68,
        "reading_time_minutes": 1,
        "has_images": true,
        "view_count": 9802
      }
    },
    {
      "article_id": "ART000223",
      "title": "Judicial system digitization accelerated",
      "content": "Courts rolled out e-filing and virtual hearing capabilities in 15 districts. According to official statements, this represents a major policy shift. The decision follows extensive consultations with stakeholders and technical experts. Implementation will be phased over the next 12-18 months. Independent analysts have welcomed the move, noting its potential long-term benefits. Critics, however, raised concerns about execution capacity. A monitoring committee will oversee progress.",
      "summary": "Courts rolled out e-filing and virtual hearing capabilities in 15 districts.",
      "category": "Legal",
      "source": "Newsfirst",
      "author": "Special Correspondent",
      "published_at": "2025-11-18T17:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000223",
      "metadata": {
        "word_count": 64,
        "reading_time_minutes": 1,
        "has_images": false,
        "view_count": 2332
      }
    },
    {
      "article_id": "ART000063",
      "title": "Stock market reaches 12-month high",
      "content": "The Colombo Stock Exchange All Share Price Index closed at a 12-month peak, driven by banking sector gains. The initiative aligns with broader national development objectives outlined in recent planning documents. Funding arrangements have been secured through a combination of domestic resources and international partnerships. Key performance indicators will track impact and outcomes. Regional variations in implementation are expected. Public feedback mechanisms have been established. Preliminary results will be reviewed in six months.",
      "summary": "The Colombo Stock Exchange All Share Price Index closed at a 12-month peak, driven by banking sector gains.",
      "category": "Economic",
      "source": "Hiru News",
      "author": "News Desk",
      "published_at": "2025-11-18T21:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000063",
      "metadata": {
        "word_count": 73,
        "reading_time_minutes": 1,
        "has_images": true,
        "view_count": 6137
      }
    },
    {
      "article_id": "ART000183",
      "title": "Plastic ban extended to single-use products",
      "content": "Environmental regulations now prohibit 15 categories of single-use plastics nationwide. Industry experts believe this development will have significant implications for the sector. Stakeholders are closely monitoring the situation as implementation details emerge. The announcement comes amid broader efforts to address systemic challenges. Officials indicated that consultations with affected parties would continue. Further details are expected to be released in the coming weeks.",
      "summary": "Environmental regulations now prohibit 15 categories of single-use plastics nationwide.",
      "category": "Environmental",
      "source": "Ada Derana",
      "author": "Political Editor",
      "published_at": "2025-11-18T22:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000183",
      "metadata": {
        "word_count": 62,
        "reading_time_minutes": 1,
        "has_images": false,
        "view_count": 9341
      }
    },
    {
      "article_id": "ART000064",
      "title": "Foreign reserves increase by $500 million",
      "content": "The Central Bank reported gross official reserves rose to $4.2 billion, reflecting improved external position. The initiative aligns with broader national development objectives outlined in recent planning documents. Funding arrangements have been secured through a combination of domestic resources and international partnerships. Key performance indicators will track impact and outcomes. Regional variations in implementation are expected. Public feedback mechanisms have been established. Preliminary results will be reviewed in six months.",
      "summary": "The Central Bank reported gross official reserves rose to $4.2 billion, reflecting improved external position.",
      "category": "Economic",
      "source": "Ada Derana",
      "author": "Field Reporter",
      "published_at": "2025-11-19T01:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000064",
      "metadata": {
        "word_count": 70,
        "reading_time_minutes": 1,
        "has_images": true,
        "view_count": 3797
      }
    },
    {
      "article_id": "ART000184",
      "title": "Climate adaptation fund receives $200M",
      "content": "International climate finance commitments will support coastal resilience and agriculture adaptation projects. Industry experts believe this development will have significant implications for the sector. Stakeholders are closely monitoring the situation as implementation details emerge. The announcement comes amid broader efforts to address systemic challenges. Officials indicated that consultations with affected parties would continue. Further details are expected to be released in the coming weeks.",
      "summary": "International climate finance commitments will support coastal resilience and agriculture adaptation projects.",
      "category": "Environmental",
      "source": "Ada Derana",
      "author": "Special Correspondent",
      "published_at": "2025-11-19T01:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000184",
      "metadata": {
        "word_count": 64,
        "reading_time_minutes": 1,
        "has_images": false,
        "view_count": 8715
      }
    },
    {
      "article_id": "ART000024",
      "title": "New diplomatic ties established with neighboring countries",
      "content": "Sri Lanka signed bilateral agreements with three regional partners, focusing on trade and security cooperation. Observers note this development reflects evolving priorities in national policy. The announcement triggered varied reactions from different interest groups. Technical feasibility studies underpinned the decision-making process. Capacity building programs will support successful rollout. International best practices informed the design. Lessons learned from pilot projects were incorporated. Accountability frameworks ensure transparency.",
      "summary": "Sri Lanka signed bilateral agreements with three regional partners, focusing on trade and security cooperation.",
      "category": "Political",
      "source": "Ada Derana",
      "author": "Economic Bureau",
      "published_at": "2025-11-19T03:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000024",
      "metadata": {
        "word_count": 65,
        "reading_time_minutes": 1,
        "has_images": false,
        "view_count": 8915
      }
    },
    {
      "article_id": "ART000104",
      "title": "Housing development project launched",
      "content": "A public-private partnership will deliver 50,000 affordable housing units over the next three years. The initiative aligns with broader national development objectives outlined in recent planning documents. Funding arrangements have been secured through a combination of domestic resources and international partnerships. Key performance indicators will track impact and outcomes. Regional variations in implementation are expected. Public feedback mechanisms have been established. Preliminary results will be reviewed in six months.",
      "summary": "A public-private partnership will deliver 50,000 affordable housing units over the next three years.",
      "category": "Social",
      "source": "Newsfirst",
      "author": "Political Editor",
      "published_at": "2025-11-19T03:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000104",
      "metadata": {
        "word_count": 69,
        "reading_time_minutes": 1,
        "has_images": false,
        "view_count": 5738
      }
    },
    {
      "article_id": "ART000224",
      "title": "Competition law amended",
      "content": "The Competition Commission received enhanced powers to investigate anti-competitive practices. The initiative aligns with broader national development objectives outlined in recent planning documents. Funding arrangements have been secured through a combination of domestic resources and international partnerships. Key performance indicators will track impact and outcomes. Regional variations in implementation are expected. Public feedback mechanisms have been established. Preliminary results will be reviewed in six months.",
      "summary": "The Competition Commission received enhanced powers to investigate anti-competitive practices.",
      "category": "Legal",
      "source": "Daily News",
      "author": "Economic Bureau",
      "published_at": "2025-11-19T17:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000224",
      "metadata": {
        "word_count": 65,
        "reading_time_minutes": 1,
        "has_images": false,
        "view_count": 9183
      }
    },
    {
      "article_id": "ART000144",
      "title": "Digital payment adoption reaches 60%",
      "content": "Mobile payment transactions grew 85% year-on-year as cashless adoption accelerated across demographics. According to official statements, this represents a major policy shift. The decision follows extensive consultations with stakeholders and technical experts. Implementation will be phased over the next 12-18 months. Independent analysts have welcomed the move, noting its potential long-term benefits. Critics, however, raised concerns about execution capacity. A monitoring committee will oversee progress.",
      "summary": "Mobile payment transactions grew 85% year-on-year as cashless adoption accelerated across demographics.",
      "category": "Technological",
      "source": "Ada Derana",
      "author": "Economic Bureau",
      "published_at": "2025-11-19T22:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000144",
      "metadata": {
        "word_count": 65,
        "reading_time_minutes": 1,
        "has_images": false,
        "view_count": 636
      }
    },
    {
      "article_id": "ART000185",
      "title": "Deforestation rate drops by 30%",
      "content": "Satellite monitoring showed forest cover increased due to reforestation initiatives and enforcement. The initiative aligns with broader national development objectives outlined in recent planning documents. Funding arrangements have been secured through a combination of domestic resources and international partnerships. Key performance indicators will track impact and outcomes. Regional variations in implementation are expected. Public feedback mechanisms have been established. Preliminary results will be reviewed in six months.",
      "summary": "Satellite monitoring showed forest cover increased due to reforestation initiatives and enforcement.",
      "category": "Environmental",
      "source": "The Island",
      "author": "Economic Bureau",
      "published_at": "2025-11-20T01:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000185",
      "metadata": {
        "word_count": 67,
        "reading_time_minutes": 1,
        "has_images": true,
        "view_count": 5159
      }
    },
    {
      "article_id": "ART000226",
      "title": "Intellectual property regime updated",
      "content": "Patent and trademark laws were harmonized with international treaties to support innovation. According to official statements, this represents a major policy shift. The decision follows extensive consultations with stakeholders and technical experts. Implementation will be phased over the next 12-18 months. Independent analysts have welcomed the move, noting its potential long-term benefits. Critics, however, raised concerns about execution capacity. A monitoring committee will oversee progress.",
      "summary": "Patent and trademark laws were harmonized with international treaties to support innovation.",
      "category": "Legal",
      "source": "Ada Derana",
      "author": "Political Editor",
      "published_at": "2025-11-20T02:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000226",
      "metadata": {
        "word_count": 65,
        "reading_time_minutes": 1,
        "has_images": false,
        "view_count": 3002
      }
    },
    {
      "article_id": "ART000065",
      "title": "Government unveils tax reform package",
      "content": "The Finance Ministry announced comprehensive tax reforms aimed at broadening the revenue base and reducing compliance costs. According to official statements, this represents a major policy shift. The decision follows extensive consultations with stakeholders and technical experts. Implementation will be phased over the next 12-18 months. Independent analysts have welcomed the move, noting its potential long-term benefits. Critics, however, raised concerns about execution capacity. A monitoring committee will oversee progress.",
      "summary": "The Finance Ministry announced comprehensive tax reforms aimed at broadening the revenue base and reducing compliance costs.",
      "category": "Economic",
      "source": "Newsfirst",
      "author": "Political Editor",
      "published_at": "2025-11-20T03:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000065",
      "metadata": {
        "word_count": 70,
        "reading_time_minutes": 1,
        "has_images": false,
        "view_count": 3469
      }
    },
    {
      "article_id": "ART000145",
      "title": "Tech startup ecosystem attracts $100M investment",
      "content": "Venture capital funding into Sri Lankan startups reached a record high, focusing on fintech and edtech. The initiative aligns with broader national development objectives outlined in recent planning documents. Funding arrangements have been secured through a combination of domestic resources and international partnerships. Key performance indicators will track impact and outcomes. Regional variations in implementation are expected. Public feedback mechanisms have been established. Preliminary results will be reviewed in six months.",
      "summary": "Venture capital funding into Sri Lankan startups reached a record high, focusing on fintech and edtech.",
      "category": "Technological",
      "source": "Hiru News",
      "author": "Staff Reporter",
      "published_at": "2025-11-20T06:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000145",
      "metadata": {
        "word_count": 71,
        "reading_time_minutes": 1,
        "has_images": false,
        "view_count": 7734
      }
    },
    {
      "article_id": "ART000105",
      "title": "Poverty alleviation program expanded",
      "content": "The Samurdhi welfare program coverage was extended to an additional 200,000 families in rural areas. According to official statements, this represents a major policy shift. The decision follows extensive consultations with stakeholders and technical experts. Implementation will be phased over the next 12-18 months. Independent analysts have welcomed the move, noting its potential long-term benefits. Critics, however, raised concerns about execution capacity. A monitoring committee will oversee progress.",
      "summary": "The Samurdhi welfare program coverage was extended to an additional 200,000 families in rural areas.",
      "category": "Social",
      "source": "Newsfirst",
      "author": "Special Correspondent",
      "published_at": "2025-11-20T10:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000105",
      "metadata": {
        "word_count": 68,
        "reading_time_minutes": 1,
        "has_images": true,
        "view_count": 5427
      }
    },
    {
      "article_id": "ART000106",
      "title": "Youth skills training initiative announced",
      "content": "A national skills development program will train 100,000 youth in digital and vocational skills. Observers note this development reflects evolving priorities in national policy. The announcement triggered varied reactions from different interest groups. Technical feasibility studies underpinned the decision-making process. Capacity building programs will support successful rollout. International best practices informed the design. Lessons learned from pilot projects were incorporated. Accountability frameworks ensure transparency.",
      "summary": "A national skills development program will train 100,000 youth in digital and vocational skills.",
      "category": "Social",
      "source": "Hiru News",
      "author": "Field Reporter",
      "published_at": "2025-11-20T11:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000106",
      "metadata": {
        "word_count": 64,
        "reading_time_minutes": 1,
        "has_images": true,
        "view_count": 7775
      }
    },
    {
      "article_id": "ART000066",
      "title": "Export earnings grow 15% year-on-year",
      "content": "Merchandise exports reached $1.8 billion last month, with strong performance in textiles and IT services. Observers note this development reflects evolving priorities in national policy. The announcement triggered varied reactions from different interest groups. Technical feasibility studies underpinned the decision-making process. Capacity building programs will support successful rollout. International best practices informed the design. Lessons learned from pilot projects were incorporated. Accountability frameworks ensure transparency.",
      "summary": "Merchandise exports reached $1.8 billion last month, with strong performance in textiles and IT services.",
      "category": "Economic",
      "source": "Colombo Gazette",
      "author": "Political Editor",
      "published_at": "2025-11-20T13:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000066",
      "metadata": {
        "word_count": 65,
        "reading_time_minutes": 1,
        "has_images": true,
        "view_count": 5682
      }
    },
    {
      "article_id": "ART000146",
      "title": "Smart city pilot launched in Kandy",
      "content": "An IoT-enabled urban management system was deployed covering traffic, waste, and energy management. Observers note this development reflects evolving priorities in national policy. The announcement triggered varied reactions from different interest groups. Technical feasibility studies underpinned the decision-making process. Capacity building programs will support successful rollout. International best practices informed the design. Lessons learned from pilot projects were incorporated. Accountability frameworks ensure transparency.",
      "summary": "An IoT-enabled urban management system was deployed covering traffic, waste, and energy management.",
      "category": "Technological",
      "source": "Daily News",
      "author": "Political Editor",
      "published_at": "2025-11-20T15:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000146",
      "metadata": {
        "word_count": 63,
        "reading_time_minutes": 1,
        "has_images": false,
        "view_count": 1114
      }
    },
    {
      "article_id": "ART000186",
      "title": "Electric vehicle adoption exceeds targets",
      "content": "Electric vehicle registrations surpassed 50,000, ahead of government projections for the year. Industry experts believe this development will have significant implications for the sector. Stakeholders are closely monitoring the situation as implementation details emerge. The announcement comes amid broader efforts to address systemic challenges. Officials indicated that consultations with affected parties would continue. Further details are expected to be released in the coming weeks.",
      "summary": "Electric vehicle registrations surpassed 50,000, ahead of government projections for the year.",
      "category": "Environmental",
      "source": "Colombo Gazette",
      "author": "Political Editor",
      "published_at": "2025-11-20T16:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000186",
      "metadata": {
        "word_count": 64,
        "reading_time_minutes": 1,
        "has_images": true,
        "view_count": 2235
      }
    },
    {
      "article_id": "ART000025",
      "title": "Provincial council elections postponed",
      "content": "The Election Commission announced a delay in provincial council elections due to pending legal challenges. Industry experts believe this development will have significant implications for the sector. Stakeholders are closely monitoring the situation as implementation details emerge. The announcement comes amid broader efforts to address systemic challenges. Officials indicated that consultations with affected parties would continue. Further details are expected to be released in the coming weeks.",
      "summary": "The Election Commission announced a delay in provincial council elections due to pending legal challenges.",
      "category": "Political",
      "source": "Colombo Gazette",
      "author": "Staff Reporter",
      "published_at": "2025-11-20T17:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000025",
      "metadata": {
        "word_count": 67,
        "reading_time_minutes": 1,
        "has_images": true,
        "view_count": 5578
      }
    },
    {
      "article_id": "ART000026",
      "title": "Anti-corruption commission launches probe",
      "content": "The Commission to Investigate Allegations of Bribery or Corruption initiated investigations into several high-profile cases. Observers note this development reflects evolving priorities in national policy. The announcement triggered varied reactions from different interest groups. Technical feasibility studies underpinned the decision-making process. Capacity building programs will support successful rollout. International best practices informed the design. Lessons learned from pilot projects were incorporated. Accountability frameworks ensure transparency.",
      "summary": "The Commission to Investigate Allegations of Bribery or Corruption initiated investigations into several high-profile cases.",
      "category": "Political",
      "source": "Newsfirst",
      "author": "Economic Bureau",
      "published_at": "2025-11-20T23:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000026",
      "metadata": {
        "word_count": 65,
        "reading_time_minutes": 1,
        "has_images": false,
        "view_count": 4110
      }
    },
    {
      "article_id": "ART000225",
      "title": "Labor law reforms approved",
      "content": "Amendments to labor legislation introduced flexible work arrangements and strengthened worker protections. According to official statements, this represents a major policy shift. The decision follows extensive consultations with stakeholders and technical experts. Implementation will be phased over the next 12-18 months. Independent analysts have welcomed the move, noting its potential long-term benefits. Critics, however, raised concerns about execution capacity. A monitoring committee will oversee progress.",
      "summary": "Amendments to labor legislation introduced flexible work arrangements and strengthened worker protections.",
      "category": "Legal",
      "source": "The Island",
      "author": "News Desk",
      "published_at": "2025-11-20T23:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000225",
      "metadata": {
        "word_count": 65,
        "reading_time_minutes": 1,
        "has_images": true,
        "view_count": 5313
      }
    },
    {
      "article_id": "ART000027",
      "title": "Parliament passes constitutional amendment",
      "content": "A landmark constitutional amendment was passed with a two-thirds majority, strengthening parliamentary oversight. Industry experts believe this development will have significant implications for the sector. Stakeholders are closely monitoring the situation as implementation details emerge. The announcement comes amid broader efforts to address systemic challenges. Officials indicated that consultations with affected parties would continue. Further details are expected to be released in the coming weeks.",
      "summary": "A landmark constitutional amendment was passed with a two-thirds majority, strengthening parliamentary oversight.",
      "category": "Political",
      "source": "Ada Derana",
      "author": "Special Correspondent",
      "published_at": "2025-11-21T03:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000027",
      "metadata": {
        "word_count": 65,
        "reading_time_minutes": 1,
        "has_images": false,
        "view_count": 3642
      }
    },
    {
      "article_id": "ART000107",
      "title": "Public health campaign targets malnutrition",
      "content": "The Ministry of Health launched a comprehensive nutrition intervention targeting children under five. According to official statements, this represents a major policy shift. The decision follows extensive consultations with stakeholders and technical experts. Implementation will be phased over the next 12-18 months. Independent analysts have welcomed the move, noting its potential long-term benefits. Critics, however, raised concerns about execution capacity. A monitoring committee will oversee progress.",
      "summary": "The Ministry of Health launched a comprehensive nutrition intervention targeting children under five.",
      "category": "Social",
      "source": "Hiru News",
      "author": "Economic Bureau",
      "published_at": "2025-11-21T05:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000107",
      "metadata": {
        "word_count": 66,
        "reading_time_minutes": 1,
        "has_images": false,
        "view_count": 9019
      }
    },
    {
      "article_id": "ART000227",
      "title": "Environmental compliance penalties increased",
      "content": "New regulations imposed stricter fines for environmental violations by industrial facilities. According to official statements, this represents a major policy shift. The decision follows extensive consultations with stakeholders and technical experts. Implementation will be phased over the next 12-18 months. Independent analysts have welcomed the move, noting its potential long-term benefits. Critics, however, raised concerns about execution capacity. A monitoring committee will oversee progress.",
      "summary": "New regulations imposed stricter fines for environmental violations by industrial facilities.",
      "category": "Legal",
      "source": "The Island",
      "author": "Field Reporter",
      "published_at": "2025-11-21T06:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000227",
      "metadata": {
        "word_count": 64,
        "reading_time_minutes": 1,
        "has_images": true,
        "view_count": 7646
      }
    },
    {
      "article_id": "ART000147",
      "title": "E-government services expanded",
      "content": "Citizens can now access 150 government services online through a unified digital platform. According to official statements, this represents a major policy shift. The decision follows extensive consultations with stakeholders and technical experts. Implementation will be phased over the next 12-18 months. Independent analysts have welcomed the move, noting its potential long-term benefits. Critics, however, raised concerns about execution capacity. A monitoring committee will oversee progress.",
      "summary": "Citizens can now access 150 government services online through a unified digital platform.",
      "category": "Technological",
      "source": "Colombo Gazette",
      "author": "News Desk",
      "published_at": "2025-11-21T07:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000147",
      "metadata": {
        "word_count": 66,
        "reading_time_minutes": 1,
        "has_images": false,
        "view_count": 7268
      }
    },
    {
      "article_id": "ART000067",
      "title": "Inflation rate drops to single digits",
      "content": "Consumer price inflation moderated to 8.9% in the latest reading, down from double digits earlier this year. Industry experts believe this development will have significant implications for the sector. Stakeholders are closely monitoring the situation as implementation details emerge. The announcement comes amid broader efforts to address systemic challenges. Officials indicated that consultations with affected parties would continue. Further details are expected to be released in the coming weeks.",
      "summary": "Consumer price inflation moderated to 8.9% in the latest reading, down from double digits earlier this year.",
      "category": "Economic",
      "source": "Colombo Gazette",
      "author": "Staff Reporter",
      "published_at": "2025-11-21T13:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000067",
      "metadata": {
        "word_count": 69,
        "reading_time_minutes": 1,
        "has_images": false,
        "view_count": 9197
      }
    },
    {
      "article_id": "ART000187",
      "title": "Water management project completed",
      "content": "A comprehensive watershed restoration program improved water security for 500,000 people. Industry experts believe this development will have significant implications for the sector. Stakeholders are closely monitoring the situation as implementation details emerge. The announcement comes amid broader efforts to address systemic challenges. Officials indicated that consultations with affected parties would continue. Further details are expected to be released in the coming weeks.",
      "summary": "A comprehensive watershed restoration program improved water security for 500,000 people.",
      "category": "Environmental",
      "source": "Daily News",
      "author": "Staff Reporter",
      "published_at": "2025-11-21T19:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000187",
      "metadata": {
        "word_count": 63,
        "reading_time_minutes": 1,
        "has_images": false,
        "view_count": 8838
      }
    },
    {
      "article_id": "ART000148",
      "title": "Research institute develops local AI model",
      "content": "Scientists at a national research center created a Sinhala and Tamil language processing model. Observers note this development reflects evolving priorities in national policy. The announcement triggered varied reactions from different interest groups. Technical feasibility studies underpinned the decision-making process. Capacity building programs will support successful rollout. International best practices informed the design. Lessons learned from pilot projects were incorporated. Accountability frameworks ensure transparency.",
      "summary": "Scientists at a national research center created a Sinhala and Tamil language processing model.",
      "category": "Technological",
      "source": "Newsfirst",
      "author": "Staff Reporter",
      "published_at": "2025-11-22T10:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000148",
      "metadata": {
        "word_count": 64,
        "reading_time_minutes": 1,
        "has_images": false,
        "view_count": 9913
      }
    },
    {
      "article_id": "ART000188",
      "title": "Carbon neutrality roadmap announced",
      "content": "The government committed to achieving carbon neutrality by 2050 with interim targets for 2030. Industry experts believe this development will have significant implications for the sector. Stakeholders are closely monitoring the situation as implementation details emerge. The announcement comes amid broader efforts to address systemic challenges. Officials indicated that consultations with affected parties would continue. Further details are expected to be released in the coming weeks.",
      "summary": "The government committed to achieving carbon neutrality by 2050 with interim targets for 2030.",
      "category": "Environmental",
      "source": "Hiru News",
      "author": "News Desk",
      "published_at": "2025-11-22T11:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000188",
      "metadata": {
        "word_count": 66,
        "reading_time_minutes": 1,
        "has_images": false,
        "view_count": 2581
      }
    },
    {
      "article_id": "ART000108",
      "title": "Gender equality index shows improvement",
      "content": "Sri Lanka moved up five places in the global gender gap index, driven by educational parity gains. Observers note this development reflects evolving priorities in national policy. The announcement triggered varied reactions from different interest groups. Technical feasibility studies underpinned the decision-making process. Capacity building programs will support successful rollout. International best practices informed the design. Lessons learned from pilot projects were incorporated. Accountability frameworks ensure transparency.",
      "summary": "Sri Lanka moved up five places in the global gender gap index, driven by educational parity gains.",
      "category": "Social",
      "source": "Ada Derana",
      "author": "Special Correspondent",
      "published_at": "2025-11-22T13:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000108",
      "metadata": {
        "word_count": 67,
        "reading_time_minutes": 1,
        "has_images": true,
        "view_count": 9493
      }
    },
    {
      "article_id": "ART000068",
      "title": "Credit rating agency upgrades outlook",
      "content": "International rating agency Moody's revised Sri Lanka's outlook from negative to stable, citing fiscal consolidation. According to official statements, this represents a major policy shift. The decision follows extensive consultations with stakeholders and technical experts. Implementation will be phased over the next 12-18 months. Independent analysts have welcomed the move, noting its potential long-term benefits. Critics, however, raised concerns about execution capacity. A monitoring committee will oversee progress.",
      "summary": "International rating agency Moody's revised Sri Lanka's outlook from negative to stable, citing fiscal consolidation.",
      "category": "Economic",
      "source": "The Island",
      "author": "Special Correspondent",
      "published_at": "2025-11-22T17:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000068",
      "metadata": {
        "word_count": 68,
        "reading_time_minutes": 1,
        "has_images": false,
        "view_count": 9469
      }
    },
    {
      "article_id": "ART000028",
      "title": "Political parties form coalition for upcoming elections",
      "content": "Five political parties announced a coalition agreement ahead of general elections scheduled for next year. Industry experts believe this development will have significant implications for the sector. Stakeholders are closely monitoring the situation as implementation details emerge. The announcement comes amid broader efforts to address systemic challenges. Officials indicated that consultations with affected parties would continue. Further details are expected to be released in the coming weeks.",
      "summary": "Five political parties announced a coalition agreement ahead of general elections scheduled for next year.",
      "category": "Political",
      "source": "Hiru News",
      "author": "Economic Bureau",
      "published_at": "2025-11-22T21:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000028",
      "metadata": {
        "word_count": 67,
        "reading_time_minutes": 1,
        "has_images": true,
        "view_count": 2644
      }
    },
    {
      "article_id": "ART000228",
      "title": "Consumer protection bureau established",
      "content": "A dedicated authority was created to address consumer complaints and enforce fair trading practices. The initiative aligns with broader national development objectives outlined in recent planning documents. Funding arrangements have been secured through a combination of domestic resources and international partnerships. Key performance indicators will track impact and outcomes. Regional variations in implementation are expected. Public feedback mechanisms have been established. Preliminary results will be reviewed in six months.",
      "summary": "A dedicated authority was created to address consumer complaints and enforce fair trading practices.",
      "category": "Legal",
      "source": "Newsfirst",
      "author": "News Desk",
      "published_at": "2025-11-22T23:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000228",
      "metadata": {
        "word_count": 69,
        "reading_time_minutes": 1,
        "has_images": true,
        "view_count": 9380
      }
    },
    {
      "article_id": "ART000109",
      "title": "Rural connectivity project connects 500 villages",
      "content": "A telecommunications infrastructure project brought 4G coverage to remote communities. The initiative aligns with broader national development objectives outlined in recent planning documents. Funding arrangements have been secured through a combination of domestic resources and international partnerships. Key performance indicators will track impact and outcomes. Regional variations in implementation are expected. Public feedback mechanisms have been established. Preliminary results will be reviewed in six months.",
      "summary": "A telecommunications infrastructure project brought 4G coverage to remote communities.",
      "category": "Social",
      "source": "Daily News",
      "author": "Special Correspondent",
      "published_at": "2025-11-23T01:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000109",
      "metadata": {
        "word_count": 65,
        "reading_time_minutes": 1,
        "has_images": false,
        "view_count": 4708
      }
    },
    {
      "article_id": "ART000070",
      "title": "Colombo Port handles record container volumes",
      "content": "The Port of Colombo processed 1.8 million TEUs last quarter, marking a 12% increase from the previous year. Observers note this development reflects evolving priorities in national policy. The announcement triggered varied reactions from different interest groups. Technical feasibility studies underpinned the decision-making process. Capacity building programs will support successful rollout. International best practices informed the design. Lessons learned from pilot projects were incorporated. Accountability frameworks ensure transparency.",
      "summary": "The Port of Colombo processed 1.8 million TEUs last quarter, marking a 12% increase from the previous year.",
      "category": "Economic",
      "source": "Daily News",
      "author": "Special Correspondent",
      "published_at": "2025-11-23T03:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000070",
      "metadata": {
        "word_count": 68,
        "reading_time_minutes": 1,
        "has_images": false,
        "view_count": 2144
      }
    },
    {
      "article_id": "ART000150",
      "title": "National broadband policy targets 95% coverage",
      "content": "A policy framework aims to provide high-speed internet access to 95% of households by 2026. The initiative aligns with broader national development objectives outlined in recent planning documents. Funding arrangements have been secured through a combination of domestic resources and international partnerships. Key performance indicators will track impact and outcomes. Regional variations in implementation are expected. Public feedback mechanisms have been established. Preliminary results will be reviewed in six months.",
      "summary": "A policy framework aims to provide high-speed internet access to 95% of households by 2026.",
      "category": "Technological",
      "source": "Newsfirst",
      "author": "News Desk",
      "published_at": "2025-11-23T03:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000150",
      "metadata": {
        "word_count": 70,
        "reading_time_minutes": 1,
        "has_images": true,
        "view_count": 7591
      }
    },
    {
      "article_id": "ART000149",
      "title": "Blockchain pilot for land registry",
      "content": "The Land Registry Department initiated a blockchain-based property registration system in select districts. According to official statements, this represents a major policy shift. The decision follows extensive consultations with stakeholders and technical experts. Implementation will be phased over the next 12-18 months. Independent analysts have welcomed the move, noting its potential long-term benefits. Critics, however, raised concerns about execution capacity. A monitoring committee will oversee progress.",
      "summary": "The Land Registry Department initiated a blockchain-based property registration system in select districts.",
      "category": "Technological",
      "source": "Ada Derana",
      "author": "News Desk",
      "published_at": "2025-11-23T06:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000149",
      "metadata": {
        "word_count": 66,
        "reading_time_minutes": 1,
        "has_images": false,
        "view_count": 2144
      }
    },
    {
      "article_id": "ART000189",
      "title": "Wildlife corridor protection law passed",
      "content": "New legislation protects 12 critical wildlife corridors connecting national parks and reserves. According to official statements, this represents a major policy shift. The decision follows extensive consultations with stakeholders and technical experts. Implementation will be phased over the next 12-18 months. Independent analysts have welcomed the move, noting its potential long-term benefits. Critics, however, raised concerns about execution capacity. A monitoring committee will oversee progress.",
      "summary": "New legislation protects 12 critical wildlife corridors connecting national parks and reserves.",
      "category": "Environmental",
      "source": "Daily News",
      "author": "Staff Reporter",
      "published_at": "2025-11-23T07:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000189",
      "metadata": {
        "word_count": 65,
        "reading_time_minutes": 1,
        "has_images": false,
        "view_count": 1113
      }
    },
    {
      "article_id": "ART000030",
      "title": "Supreme Court rules on executive powers",
      "content": "The Supreme Court delivered a judgment clarifying the limits of executive authority in provincial governance. According to official statements, this represents a major policy shift. The decision follows extensive consultations with stakeholders and technical experts. Implementation will be phased over the next 12-18 months. Independent analysts have welcomed the move, noting its potential long-term benefits. Critics, however, raised concerns about execution capacity. A monitoring committee will oversee progress.",
      "summary": "The Supreme Court delivered a judgment clarifying the limits of executive authority in provincial governance.",
      "category": "Political",
      "source": "The Island",
      "author": "Political Editor",
      "published_at": "2025-11-23T08:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000030",
      "metadata": {
        "word_count": 68,
        "reading_time_minutes": 1,
        "has_images": true,
        "view_count": 7039
      }
    },
    {
      "article_id": "ART000110",
      "title": "Social security net strengthened",
      "content": "The government expanded pension coverage to include informal sector workers in a phased rollout. Observers note this development reflects evolving priorities in national policy. The announcement triggered varied reactions from different interest groups. Technical feasibility studies underpinned the decision-making process. Capacity building programs will support successful rollout. International best practices informed the design. Lessons learned from pilot projects were incorporated. Accountability frameworks ensure transparency.",
      "summary": "The government expanded pension coverage to include informal sector workers in a phased rollout.",
      "category": "Social",
      "source": "The Island",
      "author": "Special Correspondent",
      "published_at": "2025-11-23T11:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000110",
      "metadata": {
        "word_count": 64,
        "reading_time_minutes": 1,
        "has_images": false,
        "view_count": 6750
      }
    },
    {
      "article_id": "ART000190",
      "title": "Air quality monitoring network expanded",
      "content": "Real-time air quality sensors were installed in 25 cities to track pollution levels. The initiative aligns with broader national development objectives outlined in recent planning documents. Funding arrangements have been secured through a combination of domestic resources and international partnerships. Key performance indicators will track impact and outcomes. Regional variations in implementation are expected. Public feedback mechanisms have been established. Preliminary results will be reviewed in six months.",
      "summary": "Real-time air quality sensors were installed in 25 cities to track pollution levels.",
      "category": "Environmental",
      "source": "Hiru News",
      "author": "Economic Bureau",
      "published_at": "2025-11-23T11:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000190",
      "metadata": {
        "word_count": 68,
        "reading_time_minutes": 1,
        "has_images": false,
        "view_count": 163
      }
    },
    {
      "article_id": "ART000229",
      "title": "Anti-money laundering framework strengthened",
      "content": "The Financial Intelligence Unit received additional resources and powers to combat financial crimes. According to official statements, this represents a major policy shift. The decision follows extensive consultations with stakeholders and technical experts. Implementation will be phased over the next 12-18 months. Independent analysts have welcomed the move, noting its potential long-term benefits. Critics, however, raised concerns about execution capacity. A monitoring committee will oversee progress.",
      "summary": "The Financial Intelligence Unit received additional resources and powers to combat financial crimes.",
      "category": "Legal",
      "source": "Daily News",
      "author": "Special Correspondent",
      "published_at": "2025-11-23T13:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000229",
      "metadata": {
        "word_count": 66,
        "reading_time_minutes": 1,
        "has_images": true,
        "view_count": 4405
      }
    },
    {
      "article_id": "ART000230",
      "title": "Legal aid program expanded",
      "content": "Free legal services were extended to cover civil matters in addition to criminal defense. Industry experts believe this development will have significant implications for the sector. Stakeholders are closely monitoring the situation as implementation details emerge. The announcement comes amid broader efforts to address systemic challenges. Officials indicated that consultations with affected parties would continue. Further details are expected to be released in the coming weeks.",
      "summary": "Free legal services were extended to cover civil matters in addition to criminal defense.",
      "category": "Legal",
      "source": "Ada Derana",
      "author": "Special Correspondent",
      "published_at": "2025-11-23T16:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000230",
      "metadata": {
        "word_count": 66,
        "reading_time_minutes": 1,
        "has_images": true,
        "view_count": 8020
      }
    },
    {
      "article_id": "ART000029",
      "title": "Government approves decentralization policy",
      "content": "Cabinet approved a new policy framework for fiscal decentralization to provincial administrations. The initiative aligns with broader national development objectives outlined in recent planning documents. Funding arrangements have been secured through a combination of domestic resources and international partnerships. Key performance indicators will track impact and outcomes. Regional variations in implementation are expected. Public feedback mechanisms have been established. Preliminary results will be reviewed in six months.",
      "summary": "Cabinet approved a new policy framework for fiscal decentralization to provincial administrations.",
      "category": "Political",
      "source": "Colombo Gazette",
      "author": "Field Reporter",
      "published_at": "2025-11-23T20:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000029",
      "metadata": {
        "word_count": 67,
        "reading_time_minutes": 1,
        "has_images": true,
        "view_count": 9972
      }
    },
    {
      "article_id": "ART000069",
      "title": "FDI inflows surge in manufacturing sector",
      "content": "Foreign direct investment in manufacturing increased by 45% in the first quarter, led by electronics assembly. The initiative aligns with broader national development objectives outlined in recent planning documents. Funding arrangements have been secured through a combination of domestic resources and international partnerships. Key performance indicators will track impact and outcomes. Regional variations in implementation are expected. Public feedback mechanisms have been established. Preliminary results will be reviewed in six months.",
      "summary": "Foreign direct investment in manufacturing increased by 45% in the first quarter, led by electronics assembly.",
      "category": "Economic",
      "source": "Colombo Gazette",
      "author": "Field Reporter",
      "published_at": "2025-11-23T22:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000069",
      "metadata": {
        "word_count": 71,
        "reading_time_minutes": 1,
        "has_images": true,
        "view_count": 4868
      }
    },
    {
      "article_id": "ART000151",
      "title": "National AI strategy released",
      "content": "The government unveiled a comprehensive artificial intelligence roadmap targeting healthcare, agriculture, and public services. Industry experts believe this development will have significant implications for the sector. Stakeholders are closely monitoring the situation as implementation details emerge. The announcement comes amid broader efforts to address systemic challenges. Officials indicated that consultations with affected parties would continue. Further details are expected to be released in the coming weeks.",
      "summary": "The government unveiled a comprehensive artificial intelligence roadmap targeting healthcare, agriculture, and public services.",
      "category": "Technological",
      "source": "Ada Derana",
      "author": "Economic Bureau",
      "published_at": "2025-11-24T01:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000151",
      "metadata": {
        "word_count": 66,
        "reading_time_minutes": 1,
        "has_images": false,
        "view_count": 8001
      }
    },
    {
      "article_id": "ART000111",
      "title": "Healthcare spending increases by 20%",
      "content": "The government allocated an additional 50 billion rupees to the healthcare sector in the supplementary budget. According to official statements, this represents a major policy shift. The decision follows extensive consultations with stakeholders and technical experts. Implementation will be phased over the next 12-18 months. Independent analysts have welcomed the move, noting its potential long-term benefits. Critics, however, raised concerns about execution capacity. A monitoring committee will oversee progress.",
      "summary": "The government allocated an additional 50 billion rupees to the healthcare sector in the supplementary budget.",
      "category": "Social",
      "source": "The Island",
      "author": "Field Reporter",
      "published_at": "2025-11-24T09:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000111",
      "metadata": {
        "word_count": 69,
        "reading_time_minutes": 1,
        "has_images": true,
        "view_count": 5139
      }
    },
    {
      "article_id": "ART000191",
      "title": "Renewable energy capacity reaches 45%",
      "content": "Sri Lanka achieved a milestone with 45% of electricity generation from renewable sources, mainly hydro and solar. The initiative aligns with broader national development objectives outlined in recent planning documents. Funding arrangements have been secured through a combination of domestic resources and international partnerships. Key performance indicators will track impact and outcomes. Regional variations in implementation are expected. Public feedback mechanisms have been established. Preliminary results will be reviewed in six months.",
      "summary": "Sri Lanka achieved a milestone with 45% of electricity generation from renewable sources, mainly hydro and solar.",
      "category": "Environmental",
      "source": "Ada Derana",
      "author": "Field Reporter",
      "published_at": "2025-11-24T11:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000191",
      "metadata": {
        "word_count": 72,
        "reading_time_minutes": 1,
        "has_images": false,
        "view_count": 2140
      }
    },
    {
      "article_id": "ART000031",
      "title": "Parliament debates new electoral reforms bill",
      "content": "The parliament convened today to discuss proposed reforms to the electoral system, with opposition parties raising concerns about implementation timelines. Industry experts believe this development will have significant implications for the sector. Stakeholders are closely monitoring the situation as implementation details emerge. The announcement comes amid broader efforts to address systemic challenges. Officials indicated that consultations with affected parties would continue. Further details are expected to be released in the coming weeks.",
      "summary": "The parliament convened today to discuss proposed reforms to the electoral system, with opposition parties raising concerns about implementation timelines.",
      "category": "Political",
      "source": "The Island",
      "author": "Special Correspondent",
      "published_at": "2025-11-24T13:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000031",
      "metadata": {
        "word_count": 72,
        "reading_time_minutes": 1,
        "has_images": true,
        "view_count": 643
      }
    },
    {
      "article_id": "ART000071",
      "title": "Central Bank maintains interest rates",
      "content": "The Monetary Board decided to keep policy rates unchanged at 9.5%, citing stable inflation expectations. Industry experts believe this development will have significant implications for the sector. Stakeholders are closely monitoring the situation as implementation details emerge. The announcement comes amid broader efforts to address systemic challenges. Officials indicated that consultations with affected parties would continue. Further details are expected to be released in the coming weeks.",
      "summary": "The Monetary Board decided to keep policy rates unchanged at 9.5%, citing stable inflation expectations.",
      "category": "Economic",
      "source": "The Island",
      "author": "Special Correspondent",
      "published_at": "2025-11-24T18:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000071",
      "metadata": {
        "word_count": 67,
        "reading_time_minutes": 1,
        "has_images": false,
        "view_count": 3965
      }
    },
    {
      "article_id": "ART000231",
      "title": "Right to Information Act strengthened",
      "content": "Amendments to the RTI Act reduced response times and penalties for non-compliance by public officials. According to official statements, this represents a major policy shift. The decision follows extensive consultations with stakeholders and technical experts. Implementation will be phased over the next 12-18 months. Independent analysts have welcomed the move, noting its potential long-term benefits. Critics, however, raised concerns about execution capacity. A monitoring committee will oversee progress.",
      "summary": "Amendments to the RTI Act reduced response times and penalties for non-compliance by public officials.",
      "category": "Legal",
      "source": "Hiru News",
      "author": "Special Correspondent",
      "published_at": "2025-11-24T21:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000231",
      "metadata": {
        "word_count": 68,
        "reading_time_minutes": 1,
        "has_images": true,
        "view_count": 3341
      }
    },
    {
      "article_id": "ART000072",
      "title": "Tourism revenue exceeds pre-pandemic levels",
      "content": "The tourism sector reported record earnings this quarter, surpassing 2019 figures for the first time since the pandemic. The initiative aligns with broader national development objectives outlined in recent planning documents. Funding arrangements have been secured through a combination of domestic resources and international partnerships. Key performance indicators will track impact and outcomes. Regional variations in implementation are expected. Public feedback mechanisms have been established. Preliminary results will be reviewed in six months.",
      "summary": "The tourism sector reported record earnings this quarter, surpassing 2019 figures for the first time since the pandemic.",
      "category": "Economic",
      "source": "Daily News",
      "author": "Field Reporter",
      "published_at": "2025-11-25T00:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000072",
      "metadata": {
        "word_count": 73,
        "reading_time_minutes": 1,
        "has_images": true,
        "view_count": 1880
      }
    },
    {
      "article_id": "ART000032",
      "title": "Government announces cabinet reshuffle",
      "content": "The President announced a major cabinet reshuffle affecting six ministries, citing the need for fresh perspectives in key portfolios. The initiative aligns with broader national development objectives outlined in recent planning documents. Funding arrangements have been secured through a combination of domestic resources and international partnerships. Key performance indicators will track impact and outcomes. Regional variations in implementation are expected. Public feedback mechanisms have been established. Preliminary results will be reviewed in six months.",
      "summary": "The President announced a major cabinet reshuffle affecting six ministries, citing the need for fresh perspectives in key portfolios.",
      "category": "Political",
      "source": "Colombo Gazette",
      "author": "Staff Reporter",
      "published_at": "2025-11-25T02:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000032",
      "metadata": {
        "word_count": 74,
        "reading_time_minutes": 1,
        "has_images": true,
        "view_count": 7424
      }
    },
    {
      "article_id": "ART000232",
      "title": "New data protection law enacted",
      "content": "Parliament passed comprehensive data privacy legislation aligned with international standards. The initiative aligns with broader national development objectives outlined in recent planning documents. Funding arrangements have been secured through a combination of domestic resources and international partnerships. Key performance indicators will track impact and outcomes. Regional variations in implementation are expected. Public feedback mechanisms have been established. Preliminary results will be reviewed in six months.",
      "summary": "Parliament passed comprehensive data privacy legislation aligned with international standards.",
      "category": "Legal",
      "source": "Newsfirst",
      "author": "Staff Reporter",
      "published_at": "2025-11-25T03:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000232",
      "metadata": {
        "word_count": 65,
        "reading_time_minutes": 1,
        "has_images": true,
        "view_count": 1121
      }
    },
    {
      "article_id": "ART000152",
      "title": "5G network rollout begins in Colombo",
      "content": "Major telecommunications providers commenced 5G services in the capital with plans for nationwide coverage. Observers note this development reflects evolving priorities in national policy. The announcement triggered varied reactions from different interest groups. Technical feasibility studies underpinned the decision-making process. Capacity building programs will support successful rollout. International best practices informed the design. Lessons learned from pilot projects were incorporated. Accountability frameworks ensure transparency.",
      "summary": "Major telecommunications providers commenced 5G services in the capital with plans for nationwide coverage.",
      "category": "Technological",
      "source": "The Island",
      "author": "Economic Bureau",
      "published_at": "2025-11-25T14:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000152",
      "metadata": {
        "word_count": 64,
        "reading_time_minutes": 1,
        "has_images": false,
        "view_count": 4887
      }
    },
    {
      "article_id": "ART000112",
      "title": "New education policy emphasizes STEM",
      "content": "The Ministry of Education unveiled a curriculum reform prioritizing science, technology, engineering, and mathematics. Observers note this development reflects evolving priorities in national policy. The announcement triggered varied reactions from different interest groups. Technical feasibility studies underpinned the decision-making process. Capacity building programs will support successful rollout. International best practices informed the design. Lessons learned from pilot projects were incorporated. Accountability frameworks ensure transparency.",
      "summary": "The Ministry of Education unveiled a curriculum reform prioritizing science, technology, engineering, and mathematics.",
      "category": "Social",
      "source": "Newsfirst",
      "author": "Field Reporter",
      "published_at": "2025-11-25T20:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000112",
      "metadata": {
        "word_count": 64,
        "reading_time_minutes": 1,
        "has_images": false,
        "view_count": 9679
      }
    },
    {
      "article_id": "ART000192",
      "title": "Marine conservation zone expanded",
      "content": "The government designated an additional 15,000 square kilometers as a marine protected area. The initiative aligns with broader national development objectives outlined in recent planning documents. Funding arrangements have been secured through a combination of domestic resources and international partnerships. Key performance indicators will track impact and outcomes. Regional variations in implementation are expected. Public feedback mechanisms have been established. Preliminary results will be reviewed in six months.",
      "summary": "The government designated an additional 15,000 square kilometers as a marine protected area.",
      "category": "Environmental",
      "source": "Daily News",
      "author": "Political Editor",
      "published_at": "2025-11-25T21:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000192",
      "metadata": {
        "word_count": 68,
        "reading_time_minutes": 1,
        "has_images": false,
        "view_count": 7131
      }
    },
    {
      "article_id": "ART000233",
      "title": "Judicial system digitization accelerated",
      "content": "Courts rolled out e-filing and virtual hearing capabilities in 15 districts. Industry experts believe this development will have significant implications for the sector. Stakeholders are closely monitoring the situation as implementation details emerge. The announcement comes amid broader efforts to address systemic challenges. Officials indicated that consultations with affected parties would continue. Further details are expected to be released in the coming weeks.",
      "summary": "Courts rolled out e-filing and virtual hearing capabilities in 15 districts.",
      "category": "Legal",
      "source": "Ada Derana",
      "author": "Field Reporter",
      "published_at": "2025-11-26T05:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000233",
      "metadata": {
        "word_count": 63,
        "reading_time_minutes": 1,
        "has_images": true,
        "view_count": 5596
      }
    },
    {
      "article_id": "ART000034",
      "title": "New diplomatic ties established with neighboring countries",
      "content": "Sri Lanka signed bilateral agreements with three regional partners, focusing on trade and security cooperation. According to official statements, this represents a major policy shift. The decision follows extensive consultations with stakeholders and technical experts. Implementation will be phased over the next 12-18 months. Independent analysts have welcomed the move, noting its potential long-term benefits. Critics, however, raised concerns about execution capacity. A monitoring committee will oversee progress.",
      "summary": "Sri Lanka signed bilateral agreements with three regional partners, focusing on trade and security cooperation.",
      "category": "Political",
      "source": "Ada Derana",
      "author": "Field Reporter",
      "published_at": "2025-11-26T07:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000034",
      "metadata": {
        "word_count": 68,
        "reading_time_minutes": 1,
        "has_images": true,
        "view_count": 778
      }
    },
    {
      "article_id": "ART000234",
      "title": "Competition law amended",
      "content": "The Competition Commission received enhanced powers to investigate anti-competitive practices. Observers note this development reflects evolving priorities in national policy. The announcement triggered varied reactions from different interest groups. Technical feasibility studies underpinned the decision-making process. Capacity building programs will support successful rollout. International best practices informed the design. Lessons learned from pilot projects were incorporated. Accountability frameworks ensure transparency.",
      "summary": "The Competition Commission received enhanced powers to investigate anti-competitive practices.",
      "category": "Legal",
      "source": "Ada Derana",
      "author": "Economic Bureau",
      "published_at": "2025-11-26T09:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000234",
      "metadata": {
        "word_count": 60,
        "reading_time_minutes": 1,
        "has_images": false,
        "view_count": 2942
      }
    },
    {
      "article_id": "ART000154",
      "title": "Digital payment adoption reaches 60%",
      "content": "Mobile payment transactions grew 85% year-on-year as cashless adoption accelerated across demographics. The initiative aligns with broader national development objectives outlined in recent planning documents. Funding arrangements have been secured through a combination of domestic resources and international partnerships. Key performance indicators will track impact and outcomes. Regional variations in implementation are expected. Public feedback mechanisms have been established. Preliminary results will be reviewed in six months.",
      "summary": "Mobile payment transactions grew 85% year-on-year as cashless adoption accelerated across demographics.",
      "category": "Technological",
      "source": "Newsfirst",
      "author": "Special Correspondent",
      "published_at": "2025-11-26T12:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000154",
      "metadata": {
        "word_count": 67,
        "reading_time_minutes": 1,
        "has_images": true,
        "view_count": 3253
      }
    },
    {
      "article_id": "ART000113",
      "title": "Unemployment rate falls to 4.8%",
      "content": "The Department of Census and Statistics reported the unemployment rate declined for the third consecutive quarter. According to official statements, this represents a major policy shift. The decision follows extensive consultations with stakeholders and technical experts. Implementation will be phased over the next 12-18 months. Independent analysts have welcomed the move, noting its potential long-term benefits. Critics, however, raised concerns about execution capacity. A monitoring committee will oversee progress.",
      "summary": "The Department of Census and Statistics reported the unemployment rate declined for the third consecutive quarter.",
      "category": "Social",
      "source": "Daily News",
      "author": "Special Correspondent",
      "published_at": "2025-11-26T16:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000113",
      "metadata": {
        "word_count": 69,
        "reading_time_minutes": 1,
        "has_images": false,
        "view_count": 7658
      }
    },
    {
      "article_id": "ART000193",
      "title": "Plastic ban extended to single-use products",
      "content": "Environmental regulations now prohibit 15 categories of single-use plastics nationwide. According to official statements, this represents a major policy shift. The decision follows extensive consultations with stakeholders and technical experts. Implementation will be phased over the next 12-18 months. Independent analysts have welcomed the move, noting its potential long-term benefits. Critics, however, raised concerns about execution capacity. A monitoring committee will oversee progress.",
      "summary": "Environmental regulations now prohibit 15 categories of single-use plastics nationwide.",
      "category": "Environmental",
      "source": "Newsfirst",
      "author": "Special Correspondent",
      "published_at": "2025-11-26T17:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000193",
      "metadata": {
        "word_count": 63,
        "reading_time_minutes": 1,
        "has_images": false,
        "view_count": 9541
      }
    },
    {
      "article_id": "ART000153",
      "title": "Cybersecurity law enacted",
      "content": "Parliament passed the Cybersecurity Act providing a legal framework for protecting critical information infrastructure. Observers note this development reflects evolving priorities in national policy. The announcement triggered varied reactions from different interest groups. Technical feasibility studies underpinned the decision-making process. Capacity building programs will support successful rollout. International best practices informed the design. Lessons learned from pilot projects were incorporated. Accountability frameworks ensure transparency.",
      "summary": "Parliament passed the Cybersecurity Act providing a legal framework for protecting critical information infrastructure.",
      "category": "Technological",
      "source": "The Island",
      "author": "News Desk",
      "published_at": "2025-11-26T18:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000153",
      "metadata": {
        "word_count": 64,
        "reading_time_minutes": 1,
        "has_images": false,
        "view_count": 2890
      }
    },
    {
      "article_id": "ART000033",
      "title": "Opposition calls for no-confidence motion",
      "content": "Opposition parties have submitted a no-confidence motion against the Minister of Finance, criticizing recent economic policies. Industry experts believe this development will have significant implications for the sector. Stakeholders are closely monitoring the situation as implementation details emerge. The announcement comes amid broader efforts to address systemic challenges. Officials indicated that consultations with affected parties would continue. Further details are expected to be released in the coming weeks.",
      "summary": "Opposition parties have submitted a no-confidence motion against the Minister of Finance, criticizing recent economic policies.",
      "category": "Political",
      "source": "Daily News",
      "author": "News Desk",
      "published_at": "2025-11-26T19:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000033",
      "metadata": {
        "word_count": 68,
        "reading_time_minutes": 1,
        "has_images": true,
        "view_count": 426
      }
    },
    {
      "article_id": "ART000073",
      "title": "Stock market reaches 12-month high",
      "content": "The Colombo Stock Exchange All Share Price Index closed at a 12-month peak, driven by banking sector gains. The initiative aligns with broader national development objectives outlined in recent planning documents. Funding arrangements have been secured through a combination of domestic resources and international partnerships. Key performance indicators will track impact and outcomes. Regional variations in implementation are expected. Public feedback mechanisms have been established. Preliminary results will be reviewed in six months.",
      "summary": "The Colombo Stock Exchange All Share Price Index closed at a 12-month peak, driven by banking sector gains.",
      "category": "Economic",
      "source": "Daily News",
      "author": "Political Editor",
      "published_at": "2025-11-26T19:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000073",
      "metadata": {
        "word_count": 73,
        "reading_time_minutes": 1,
        "has_images": false,
        "view_count": 9717
      }
    },
    {
      "article_id": "ART000074",
      "title": "Foreign reserves increase by $500 million",
      "content": "The Central Bank reported gross official reserves rose to $4.2 billion, reflecting improved external position. Observers note this development reflects evolving priorities in national policy. The announcement triggered varied reactions from different interest groups. Technical feasibility studies underpinned the decision-making process. Capacity building programs will support successful rollout. International best practices informed the design. Lessons learned from pilot projects were incorporated. Accountability frameworks ensure transparency.",
      "summary": "The Central Bank reported gross official reserves rose to $4.2 billion, reflecting improved external position.",
      "category": "Economic",
      "source": "Newsfirst",
      "author": "Special Correspondent",
      "published_at": "2025-11-26T19:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000074",
      "metadata": {
        "word_count": 65,
        "reading_time_minutes": 1,
        "has_images": false,
        "view_count": 2604
      }
    },
    {
      "article_id": "ART000194",
      "title": "Climate adaptation fund receives $200M",
      "content": "International climate finance commitments will support coastal resilience and agriculture adaptation projects. According to official statements, this represents a major policy shift. The decision follows extensive consultations with stakeholders and technical experts. Implementation will be phased over the next 12-18 months. Independent analysts have welcomed the move, noting its potential long-term benefits. Critics, however, raised concerns about execution capacity. A monitoring committee will oversee progress.",
      "summary": "International climate finance commitments will support coastal resilience and agriculture adaptation projects.",
      "category": "Environmental",
      "source": "Hiru News",
      "author": "Economic Bureau",
      "published_at": "2025-11-26T19:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000194",
      "metadata": {
        "word_count": 65,
        "reading_time_minutes": 1,
        "has_images": false,
        "view_count": 1741
      }
    },
    {
      "article_id": "ART000114",
      "title": "Housing development project launched",
      "content": "A public-private partnership will deliver 50,000 affordable housing units over the next three years. According to official statements, this represents a major policy shift. The decision follows extensive consultations with stakeholders and technical experts. Implementation will be phased over the next 12-18 months. Independent analysts have welcomed the move, noting its potential long-term benefits. Critics, however, raised concerns about execution capacity. A monitoring committee will oversee progress.",
      "summary": "A public-private partnership will deliver 50,000 affordable housing units over the next three years.",
      "category": "Social",
      "source": "Colombo Gazette",
      "author": "Economic Bureau",
      "published_at": "2025-11-26T21:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000114",
      "metadata": {
        "word_count": 67,
        "reading_time_minutes": 1,
        "has_images": false,
        "view_count": 6557
      }
    },
    {
      "article_id": "ART000155",
      "title": "Tech startup ecosystem attracts $100M investment",
      "content": "Venture capital funding into Sri Lankan startups reached a record high, focusing on fintech and edtech. According to official statements, this represents a major policy shift. The decision follows extensive consultations with stakeholders and technical experts. Implementation will be phased over the next 12-18 months. Independent analysts have welcomed the move, noting its potential long-term benefits. Critics, however, raised concerns about execution capacity. A monitoring committee will oversee progress.",
      "summary": "Venture capital funding into Sri Lankan startups reached a record high, focusing on fintech and edtech.",
      "category": "Technological",
      "source": "Ada Derana",
      "author": "Staff Reporter",
      "published_at": "2025-11-27T02:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000155",
      "metadata": {
        "word_count": 69,
        "reading_time_minutes": 1,
        "has_images": true,
        "view_count": 8833
      }
    },
    {
      "article_id": "ART000035",
      "title": "Provincial council elections postponed",
      "content": "The Election Commission announced a delay in provincial council elections due to pending legal challenges. The initiative aligns with broader national development objectives outlined in recent planning documents. Funding arrangements have been secured through a combination of domestic resources and international partnerships. Key performance indicators will track impact and outcomes. Regional variations in implementation are expected. Public feedback mechanisms have been established. Preliminary results will be reviewed in six months.",
      "summary": "The Election Commission announced a delay in provincial council elections due to pending legal challenges.",
      "category": "Political",
      "source": "Colombo Gazette",
      "author": "Special Correspondent",
      "published_at": "2025-11-27T08:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000035",
      "metadata": {
        "word_count": 70,
        "reading_time_minutes": 1,
        "has_images": false,
        "view_count": 4194
      }
    },
    {
      "article_id": "ART000195",
      "title": "Deforestation rate drops by 30%",
      "content": "Satellite monitoring showed forest cover increased due to reforestation initiatives and enforcement. The initiative aligns with broader national development objectives outlined in recent planning documents. Funding arrangements have been secured through a combination of domestic resources and international partnerships. Key performance indicators will track impact and outcomes. Regional variations in implementation are expected. Public feedback mechanisms have been established. Preliminary results will be reviewed in six months.",
      "summary": "Satellite monitoring showed forest cover increased due to reforestation initiatives and enforcement.",
      "category": "Environmental",
      "source": "Ada Derana",
      "author": "Field Reporter",
      "published_at": "2025-11-27T10:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000195",
      "metadata": {
        "word_count": 67,
        "reading_time_minutes": 1,
        "has_images": false,
        "view_count": 7656
      }
    },
    {
      "article_id": "ART000115",
      "title": "Poverty alleviation program expanded",
      "content": "The Samurdhi welfare program coverage was extended to an additional 200,000 families in rural areas. The initiative aligns with broader national development objectives outlined in recent planning documents. Funding arrangements have been secured through a combination of domestic resources and international partnerships. Key performance indicators will track impact and outcomes. Regional variations in implementation are expected. Public feedback mechanisms have been established. Preliminary results will be reviewed in six months.",
      "summary": "The Samurdhi welfare program coverage was extended to an additional 200,000 families in rural areas.",
      "category": "Social",
      "source": "Daily News",
      "author": "Political Editor",
      "published_at": "2025-11-27T11:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000115",
      "metadata": {
        "word_count": 70,
        "reading_time_minutes": 1,
        "has_images": false,
        "view_count": 5597
      }
    },
    {
      "article_id": "ART000235",
      "title": "Labor law reforms approved",
      "content": "Amendments to labor legislation introduced flexible work arrangements and strengthened worker protections. Industry experts believe this development will have significant implications for the sector. Stakeholders are closely monitoring the situation as implementation details emerge. The announcement comes amid broader efforts to address systemic challenges. Officials indicated that consultations with affected parties would continue. Further details are expected to be released in the coming weeks.",
      "summary": "Amendments to labor legislation introduced flexible work arrangements and strengthened worker protections.",
      "category": "Legal",
      "source": "Ada Derana",
      "author": "Political Editor",
      "published_at": "2025-11-27T18:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000235",
      "metadata": {
        "word_count": 64,
        "reading_time_minutes": 1,
        "has_images": true,
        "view_count": 2733
      }
    },
    {
      "article_id": "ART000075",
      "title": "Government unveils tax reform package",
      "content": "The Finance Ministry announced comprehensive tax reforms aimed at broadening the revenue base and reducing compliance costs. According to official statements, this represents a major policy shift. The decision follows extensive consultations with stakeholders and technical experts. Implementation will be phased over the next 12-18 months. Independent analysts have welcomed the move, noting its potential long-term benefits. Critics, however, raised concerns about execution capacity. A monitoring committee will oversee progress.",
      "summary": "The Finance Ministry announced comprehensive tax reforms aimed at broadening the revenue base and reducing compliance costs.",
      "category": "Economic",
      "source": "Daily News",
      "author": "Special Correspondent",
      "published_at": "2025-11-27T20:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000075",
      "metadata": {
        "word_count": 70,
        "reading_time_minutes": 1,
        "has_images": false,
        "view_count": 2092
      }
    },
    {
      "article_id": "ART000196",
      "title": "Electric vehicle adoption exceeds targets",
      "content": "Electric vehicle registrations surpassed 50,000, ahead of government projections for the year. According to official statements, this represents a major policy shift. The decision follows extensive consultations with stakeholders and technical experts. Implementation will be phased over the next 12-18 months. Independent analysts have welcomed the move, noting its potential long-term benefits. Critics, however, raised concerns about execution capacity. A monitoring committee will oversee progress.",
      "summary": "Electric vehicle registrations surpassed 50,000, ahead of government projections for the year.",
      "category": "Environmental",
      "source": "Daily News",
      "author": "Political Editor",
      "published_at": "2025-11-28T02:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000196",
      "metadata": {
        "word_count": 65,
        "reading_time_minutes": 1,
        "has_images": true,
        "view_count": 4836
      }
    },
    {
      "article_id": "ART000076",
      "title": "Export earnings grow 15% year-on-year",
      "content": "Merchandise exports reached $1.8 billion last month, with strong performance in textiles and IT services. Industry experts believe this development will have significant implications for the sector. Stakeholders are closely monitoring the situation as implementation details emerge. The announcement comes amid broader efforts to address systemic challenges. Officials indicated that consultations with affected parties would continue. Further details are expected to be released in the coming weeks.",
      "summary": "Merchandise exports reached $1.8 billion last month, with strong performance in textiles and IT services.",
      "category": "Economic",
      "source": "The Island",
      "author": "Field Reporter",
      "published_at": "2025-11-28T07:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000076",
      "metadata": {
        "word_count": 67,
        "reading_time_minutes": 1,
        "has_images": false,
        "view_count": 2783
      }
    },
    {
      "article_id": "ART000116",
      "title": "Youth skills training initiative announced",
      "content": "A national skills development program will train 100,000 youth in digital and vocational skills. The initiative aligns with broader national development objectives outlined in recent planning documents. Funding arrangements have been secured through a combination of domestic resources and international partnerships. Key performance indicators will track impact and outcomes. Regional variations in implementation are expected. Public feedback mechanisms have been established. Preliminary results will be reviewed in six months.",
      "summary": "A national skills development program will train 100,000 youth in digital and vocational skills.",
      "category": "Social",
      "source": "Hiru News",
      "author": "Special Correspondent",
      "published_at": "2025-11-28T17:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000116",
      "metadata": {
        "word_count": 69,
        "reading_time_minutes": 1,
        "has_images": false,
        "view_count": 187
      }
    },
    {
      "article_id": "ART000236",
      "title": "Intellectual property regime updated",
      "content": "Patent and trademark laws were harmonized with international treaties to support innovation. Observers note this development reflects evolving priorities in national policy. The announcement triggered varied reactions from different interest groups. Technical feasibility studies underpinned the decision-making process. Capacity building programs will support successful rollout. International best practices informed the design. Lessons learned from pilot projects were incorporated. Accountability frameworks ensure transparency.",
      "summary": "Patent and trademark laws were harmonized with international treaties to support innovation.",
      "category": "Legal",
      "source": "Hiru News",
      "author": "Economic Bureau",
      "published_at": "2025-11-28T17:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000236",
      "metadata": {
        "word_count": 62,
        "reading_time_minutes": 1,
        "has_images": true,
        "view_count": 5715
      }
    },
    {
      "article_id": "ART000156",
      "title": "Smart city pilot launched in Kandy",
      "content": "An IoT-enabled urban management system was deployed covering traffic, waste, and energy management. The initiative aligns with broader national development objectives outlined in recent planning documents. Funding arrangements have been secured through a combination of domestic resources and international partnerships. Key performance indicators will track impact and outcomes. Regional variations in implementation are expected. Public feedback mechanisms have been established. Preliminary results will be reviewed in six months.",
      "summary": "An IoT-enabled urban management system was deployed covering traffic, waste, and energy management.",
      "category": "Technological",
      "source": "Daily News",
      "author": "News Desk",
      "published_at": "2025-11-28T20:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000156",
      "metadata": {
        "word_count": 68,
        "reading_time_minutes": 1,
        "has_images": false,
        "view_count": 5212
      }
    },
    {
      "article_id": "ART000036",
      "title": "Anti-corruption commission launches probe",
      "content": "The Commission to Investigate Allegations of Bribery or Corruption initiated investigations into several high-profile cases. Industry experts believe this development will have significant implications for the sector. Stakeholders are closely monitoring the situation as implementation details emerge. The announcement comes amid broader efforts to address systemic challenges. Officials indicated that consultations with affected parties would continue. Further details are expected to be released in the coming weeks.",
      "summary": "The Commission to Investigate Allegations of Bribery or Corruption initiated investigations into several high-profile cases.",
      "category": "Political",
      "source": "Hiru News",
      "author": "Staff Reporter",
      "published_at": "2025-11-28T22:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000036",
      "metadata": {
        "word_count": 67,
        "reading_time_minutes": 1,
        "has_images": true,
        "view_count": 7110
      }
    },
    {
      "article_id": "ART000237",
      "title": "Environmental compliance penalties increased",
      "content": "New regulations imposed stricter fines for environmental violations by industrial facilities. Industry experts believe this development will have significant implications for the sector. Stakeholders are closely monitoring the situation as implementation details emerge. The announcement comes amid broader efforts to address systemic challenges. Officials indicated that consultations with affected parties would continue. Further details are expected to be released in the coming weeks.",
      "summary": "New regulations imposed stricter fines for environmental violations by industrial facilities.",
      "category": "Legal",
      "source": "Hiru News",
      "author": "Special Correspondent",
      "published_at": "2025-11-29T00:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000237",
      "metadata": {
        "word_count": 63,
        "reading_time_minutes": 1,
        "has_images": true,
        "view_count": 4284
      }
    },
    {
      "article_id": "ART000077",
      "title": "Inflation rate drops to single digits",
      "content": "Consumer price inflation moderated to 8.9% in the latest reading, down from double digits earlier this year. Industry experts believe this development will have significant implications for the sector. Stakeholders are closely monitoring the situation as implementation details emerge. The announcement comes amid broader efforts to address systemic challenges. Officials indicated that consultations with affected parties would continue. Further details are expected to be released in the coming weeks.",
      "summary": "Consumer price inflation moderated to 8.9% in the latest reading, down from double digits earlier this year.",
      "category": "Economic",
      "source": "The Island",
      "author": "Political Editor",
      "published_at": "2025-11-29T04:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000077",
      "metadata": {
        "word_count": 69,
        "reading_time_minutes": 1,
        "has_images": false,
        "view_count": 2144
      }
    },
    {
      "article_id": "ART000118",
      "title": "Gender equality index shows improvement",
      "content": "Sri Lanka moved up five places in the global gender gap index, driven by educational parity gains. According to official statements, this represents a major policy shift. The decision follows extensive consultations with stakeholders and technical experts. Implementation will be phased over the next 12-18 months. Independent analysts have welcomed the move, noting its potential long-term benefits. Critics, however, raised concerns about execution capacity. A monitoring committee will oversee progress.",
      "summary": "Sri Lanka moved up five places in the global gender gap index, driven by educational parity gains.",
      "category": "Social",
      "source": "Newsfirst",
      "author": "Field Reporter",
      "published_at": "2025-11-29T08:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000118",
      "metadata": {
        "word_count": 70,
        "reading_time_minutes": 1,
        "has_images": false,
        "view_count": 3218
      }
    },
    {
      "article_id": "ART000037",
      "title": "Parliament passes constitutional amendment",
      "content": "A landmark constitutional amendment was passed with a two-thirds majority, strengthening parliamentary oversight. Industry experts believe this development will have significant implications for the sector. Stakeholders are closely monitoring the situation as implementation details emerge. The announcement comes amid broader efforts to address systemic challenges. Officials indicated that consultations with affected parties would continue. Further details are expected to be released in the coming weeks.",
      "summary": "A landmark constitutional amendment was passed with a two-thirds majority, strengthening parliamentary oversight.",
      "category": "Political",
      "source": "Colombo Gazette",
      "author": "Special Correspondent",
      "published_at": "2025-11-29T10:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000037",
      "metadata": {
        "word_count": 65,
        "reading_time_minutes": 1,
        "has_images": true,
        "view_count": 1540
      }
    },
    {
      "article_id": "ART000197",
      "title": "Water management project completed",
      "content": "A comprehensive watershed restoration program improved water security for 500,000 people. The initiative aligns with broader national development objectives outlined in recent planning documents. Funding arrangements have been secured through a combination of domestic resources and international partnerships. Key performance indicators will track impact and outcomes. Regional variations in implementation are expected. Public feedback mechanisms have been established. Preliminary results will be reviewed in six months.",
      "summary": "A comprehensive watershed restoration program improved water security for 500,000 people.",
      "category": "Environmental",
      "source": "Hiru News",
      "author": "Special Correspondent",
      "published_at": "2025-11-29T11:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000197",
      "metadata": {
        "word_count": 66,
        "reading_time_minutes": 1,
        "has_images": false,
        "view_count": 8118
      }
    },
    {
      "article_id": "ART000198",
      "title": "Carbon neutrality roadmap announced",
      "content": "The government committed to achieving carbon neutrality by 2050 with interim targets for 2030. Industry experts believe this development will have significant implications for the sector. Stakeholders are closely monitoring the situation as implementation details emerge. The announcement comes amid broader efforts to address systemic challenges. Officials indicated that consultations with affected parties would continue. Further details are expected to be released in the coming weeks.",
      "summary": "The government committed to achieving carbon neutrality by 2050 with interim targets for 2030.",
      "category": "Environmental",
      "source": "Hiru News",
      "author": "Economic Bureau",
      "published_at": "2025-11-29T13:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000198",
      "metadata": {
        "word_count": 66,
        "reading_time_minutes": 1,
        "has_images": false,
        "view_count": 7075
      }
    },
    {
      "article_id": "ART000157",
      "title": "E-government services expanded",
      "content": "Citizens can now access 150 government services online through a unified digital platform. The initiative aligns with broader national development objectives outlined in recent planning documents. Funding arrangements have been secured through a combination of domestic resources and international partnerships. Key performance indicators will track impact and outcomes. Regional variations in implementation are expected. Public feedback mechanisms have been established. Preliminary results will be reviewed in six months.",
      "summary": "Citizens can now access 150 government services online through a unified digital platform.",
      "category": "Technological",
      "source": "Ada Derana",
      "author": "Economic Bureau",
      "published_at": "2025-11-29T14:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000157",
      "metadata": {
        "word_count": 68,
        "reading_time_minutes": 1,
        "has_images": false,
        "view_count": 3413
      }
    },
    {
      "article_id": "ART000158",
      "title": "Research institute develops local AI model",
      "content": "Scientists at a national research center created a Sinhala and Tamil language processing model. According to official statements, this represents a major policy shift. The decision follows extensive consultations with stakeholders and technical experts. Implementation will be phased over the next 12-18 months. Independent analysts have welcomed the move, noting its potential long-term benefits. Critics, however, raised concerns about execution capacity. A monitoring committee will oversee progress.",
      "summary": "Scientists at a national research center created a Sinhala and Tamil language processing model.",
      "category": "Technological",
      "source": "Colombo Gazette",
      "author": "News Desk",
      "published_at": "2025-11-29T14:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000158",
      "metadata": {
        "word_count": 67,
        "reading_time_minutes": 1,
        "has_images": false,
        "view_count": 7752
      }
    },
    {
      "article_id": "ART000238",
      "title": "Consumer protection bureau established",
      "content": "A dedicated authority was created to address consumer complaints and enforce fair trading practices. According to official statements, this represents a major policy shift. The decision follows extensive consultations with stakeholders and technical experts. Implementation will be phased over the next 12-18 months. Independent analysts have welcomed the move, noting its potential long-term benefits. Critics, however, raised concerns about execution capacity. A monitoring committee will oversee progress.",
      "summary": "A dedicated authority was created to address consumer complaints and enforce fair trading practices.",
      "category": "Legal",
      "source": "The Island",
      "author": "Political Editor",
      "published_at": "2025-11-29T19:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000238",
      "metadata": {
        "word_count": 67,
        "reading_time_minutes": 1,
        "has_images": false,
        "view_count": 1052
      }
    },
    {
      "article_id": "ART000078",
      "title": "Credit rating agency upgrades outlook",
      "content": "International rating agency Moody's revised Sri Lanka's outlook from negative to stable, citing fiscal consolidation. Observers note this development reflects evolving priorities in national policy. The announcement triggered varied reactions from different interest groups. Technical feasibility studies underpinned the decision-making process. Capacity building programs will support successful rollout. International best practices informed the design. Lessons learned from pilot projects were incorporated. Accountability frameworks ensure transparency.",
      "summary": "International rating agency Moody's revised Sri Lanka's outlook from negative to stable, citing fiscal consolidation.",
      "category": "Economic",
      "source": "Daily News",
      "author": "News Desk",
      "published_at": "2025-11-29T20:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000078",
      "metadata": {
        "word_count": 65,
        "reading_time_minutes": 1,
        "has_images": false,
        "view_count": 1605
      }
    },
    {
      "article_id": "ART000038",
      "title": "Political parties form coalition for upcoming elections",
      "content": "Five political parties announced a coalition agreement ahead of general elections scheduled for next year. Industry experts believe this development will have significant implications for the sector. Stakeholders are closely monitoring the situation as implementation details emerge. The announcement comes amid broader efforts to address systemic challenges. Officials indicated that consultations with affected parties would continue. Further details are expected to be released in the coming weeks.",
      "summary": "Five political parties announced a coalition agreement ahead of general elections scheduled for next year.",
      "category": "Political",
      "source": "Colombo Gazette",
      "author": "Staff Reporter",
      "published_at": "2025-11-29T22:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000038",
      "metadata": {
        "word_count": 67,
        "reading_time_minutes": 1,
        "has_images": false,
        "view_count": 2844
      }
    },
    {
      "article_id": "ART000117",
      "title": "Public health campaign targets malnutrition",
      "content": "The Ministry of Health launched a comprehensive nutrition intervention targeting children under five. According to official statements, this represents a major policy shift. The decision follows extensive consultations with stakeholders and technical experts. Implementation will be phased over the next 12-18 months. Independent analysts have welcomed the move, noting its potential long-term benefits. Critics, however, raised concerns about execution capacity. A monitoring committee will oversee progress.",
      "summary": "The Ministry of Health launched a comprehensive nutrition intervention targeting children under five.",
      "category": "Social",
      "source": "Ada Derana",
      "author": "Staff Reporter",
      "published_at": "2025-11-29T23:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000117",
      "metadata": {
        "word_count": 66,
        "reading_time_minutes": 1,
        "has_images": true,
        "view_count": 1806
      }
    },
    {
      "article_id": "ART000039",
      "title": "Government approves decentralization policy",
      "content": "Cabinet approved a new policy framework for fiscal decentralization to provincial administrations. According to official statements, this represents a major policy shift. The decision follows extensive consultations with stakeholders and technical experts. Implementation will be phased over the next 12-18 months. Independent analysts have welcomed the move, noting its potential long-term benefits. Critics, however, raised concerns about execution capacity. A monitoring committee will oversee progress.",
      "summary": "Cabinet approved a new policy framework for fiscal decentralization to provincial administrations.",
      "category": "Political",
      "source": "Hiru News",
      "author": "Political Editor",
      "published_at": "2025-11-30T03:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000039",
      "metadata": {
        "word_count": 65,
        "reading_time_minutes": 1,
        "has_images": false,
        "view_count": 1161
      }
    },
    {
      "article_id": "ART000079",
      "title": "FDI inflows surge in manufacturing sector",
      "content": "Foreign direct investment in manufacturing increased by 45% in the first quarter, led by electronics assembly. The initiative aligns with broader national development objectives outlined in recent planning documents. Funding arrangements have been secured through a combination of domestic resources and international partnerships. Key performance indicators will track impact and outcomes. Regional variations in implementation are expected. Public feedback mechanisms have been established. Preliminary results will be reviewed in six months.",
      "summary": "Foreign direct investment in manufacturing increased by 45% in the first quarter, led by electronics assembly.",
      "category": "Economic",
      "source": "Newsfirst",
      "author": "Staff Reporter",
      "published_at": "2025-11-30T04:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000079",
      "metadata": {
        "word_count": 71,
        "reading_time_minutes": 1,
        "has_images": true,
        "view_count": 9830
      }
    },
    {
      "article_id": "ART000159",
      "title": "Blockchain pilot for land registry",
      "content": "The Land Registry Department initiated a blockchain-based property registration system in select districts. According to official statements, this represents a major policy shift. The decision follows extensive consultations with stakeholders and technical experts. Implementation will be phased over the next 12-18 months. Independent analysts have welcomed the move, noting its potential long-term benefits. Critics, however, raised concerns about execution capacity. A monitoring committee will oversee progress.",
      "summary": "The Land Registry Department initiated a blockchain-based property registration system in select districts.",
      "category": "Technological",
      "source": "Daily News",
      "author": "Staff Reporter",
      "published_at": "2025-11-30T05:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000159",
      "metadata": {
        "word_count": 66,
        "reading_time_minutes": 1,
        "has_images": true,
        "view_count": 8028
      }
    },
    {
      "article_id": "ART000239",
      "title": "Anti-money laundering framework strengthened",
      "content": "The Financial Intelligence Unit received additional resources and powers to combat financial crimes. The initiative aligns with broader national development objectives outlined in recent planning documents. Funding arrangements have been secured through a combination of domestic resources and international partnerships. Key performance indicators will track impact and outcomes. Regional variations in implementation are expected. Public feedback mechanisms have been established. Preliminary results will be reviewed in six months.",
      "summary": "The Financial Intelligence Unit received additional resources and powers to combat financial crimes.",
      "category": "Legal",
      "source": "Newsfirst",
      "author": "Staff Reporter",
      "published_at": "2025-11-30T08:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000239",
      "metadata": {
        "word_count": 68,
        "reading_time_minutes": 1,
        "has_images": false,
        "view_count": 4023
      }
    },
    {
      "article_id": "ART000199",
      "title": "Wildlife corridor protection law passed",
      "content": "New legislation protects 12 critical wildlife corridors connecting national parks and reserves. Industry experts believe this development will have significant implications for the sector. Stakeholders are closely monitoring the situation as implementation details emerge. The announcement comes amid broader efforts to address systemic challenges. Officials indicated that consultations with affected parties would continue. Further details are expected to be released in the coming weeks.",
      "summary": "New legislation protects 12 critical wildlife corridors connecting national parks and reserves.",
      "category": "Environmental",
      "source": "The Island",
      "author": "Field Reporter",
      "published_at": "2025-11-30T14:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000199",
      "metadata": {
        "word_count": 64,
        "reading_time_minutes": 1,
        "has_images": true,
        "view_count": 8082
      }
    },
    {
      "article_id": "ART000119",
      "title": "Rural connectivity project connects 500 villages",
      "content": "A telecommunications infrastructure project brought 4G coverage to remote communities. The initiative aligns with broader national development objectives outlined in recent planning documents. Funding arrangements have been secured through a combination of domestic resources and international partnerships. Key performance indicators will track impact and outcomes. Regional variations in implementation are expected. Public feedback mechanisms have been established. Preliminary results will be reviewed in six months.",
      "summary": "A telecommunications infrastructure project brought 4G coverage to remote communities.",
      "category": "Social",
      "source": "Hiru News",
      "author": "Special Correspondent",
      "published_at": "2025-11-30T17:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000119",
      "metadata": {
        "word_count": 65,
        "reading_time_minutes": 1,
        "has_images": true,
        "view_count": 5858
      }
    },
    {
      "article_id": "ART000240",
      "title": "Legal aid program expanded",
      "content": "Free legal services were extended to cover civil matters in addition to criminal defense. Industry experts believe this development will have significant implications for the sector. Stakeholders are closely monitoring the situation as implementation details emerge. The announcement comes amid broader efforts to address systemic challenges. Officials indicated that consultations with affected parties would continue. Further details are expected to be released in the coming weeks.",
      "summary": "Free legal services were extended to cover civil matters in addition to criminal defense.",
      "category": "Legal",
      "source": "Ada Derana",
      "author": "News Desk",
      "published_at": "2025-12-01T01:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000240",
      "metadata": {
        "word_count": 66,
        "reading_time_minutes": 1,
        "has_images": true,
        "view_count": 2559
      }
    },
    {
      "article_id": "ART000200",
      "title": "Air quality monitoring network expanded",
      "content": "Real-time air quality sensors were installed in 25 cities to track pollution levels. Industry experts believe this development will have significant implications for the sector. Stakeholders are closely monitoring the situation as implementation details emerge. The announcement comes amid broader efforts to address systemic challenges. Officials indicated that consultations with affected parties would continue. Further details are expected to be released in the coming weeks.",
      "summary": "Real-time air quality sensors were installed in 25 cities to track pollution levels.",
      "category": "Environmental",
      "source": "Daily News",
      "author": "News Desk",
      "published_at": "2025-12-01T09:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000200",
      "metadata": {
        "word_count": 65,
        "reading_time_minutes": 1,
        "has_images": false,
        "view_count": 3257
      }
    },
    {
      "article_id": "ART000080",
      "title": "Colombo Port handles record container volumes",
      "content": "The Port of Colombo processed 1.8 million TEUs last quarter, marking a 12% increase from the previous year. Industry experts believe this development will have significant implications for the sector. Stakeholders are closely monitoring the situation as implementation details emerge. The announcement comes amid broader efforts to address systemic challenges. Officials indicated that consultations with affected parties would continue. Further details are expected to be released in the coming weeks.",
      "summary": "The Port of Colombo processed 1.8 million TEUs last quarter, marking a 12% increase from the previous year.",
      "category": "Economic",
      "source": "The Island",
      "author": "Field Reporter",
      "published_at": "2025-12-01T12:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000080",
      "metadata": {
        "word_count": 70,
        "reading_time_minutes": 1,
        "has_images": true,
        "view_count": 602
      }
    },
    {
      "article_id": "ART000160",
      "title": "National broadband policy targets 95% coverage",
      "content": "A policy framework aims to provide high-speed internet access to 95% of households by 2026. The initiative aligns with broader national development objectives outlined in recent planning documents. Funding arrangements have been secured through a combination of domestic resources and international partnerships. Key performance indicators will track impact and outcomes. Regional variations in implementation are expected. Public feedback mechanisms have been established. Preliminary results will be reviewed in six months.",
      "summary": "A policy framework aims to provide high-speed internet access to 95% of households by 2026.",
      "category": "Technological",
      "source": "The Island",
      "author": "Special Correspondent",
      "published_at": "2025-12-01T16:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000160",
      "metadata": {
        "word_count": 70,
        "reading_time_minutes": 1,
        "has_images": false,
        "view_count": 297
      }
    },
    {
      "article_id": "ART000120",
      "title": "Social security net strengthened",
      "content": "The government expanded pension coverage to include informal sector workers in a phased rollout. Observers note this development reflects evolving priorities in national policy. The announcement triggered varied reactions from different interest groups. Technical feasibility studies underpinned the decision-making process. Capacity building programs will support successful rollout. International best practices informed the design. Lessons learned from pilot projects were incorporated. Accountability frameworks ensure transparency.",
      "summary": "The government expanded pension coverage to include informal sector workers in a phased rollout.",
      "category": "Social",
      "source": "Newsfirst",
      "author": "Political Editor",
      "published_at": "2025-12-01T19:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000120",
      "metadata": {
        "word_count": 64,
        "reading_time_minutes": 1,
        "has_images": true,
        "view_count": 7513
      }
    },
    {
      "article_id": "ART000040",
      "title": "Supreme Court rules on executive powers",
      "content": "The Supreme Court delivered a judgment clarifying the limits of executive authority in provincial governance. Observers note this development reflects evolving priorities in national policy. The announcement triggered varied reactions from different interest groups. Technical feasibility studies underpinned the decision-making process. Capacity building programs will support successful rollout. International best practices informed the design. Lessons learned from pilot projects were incorporated. Accountability frameworks ensure transparency.",
      "summary": "The Supreme Court delivered a judgment clarifying the limits of executive authority in provincial governance.",
      "category": "Political",
      "source": "Newsfirst",
      "author": "Staff Reporter",
      "published_at": "2025-12-01T21:03:23.277837",
      "language": "en",
      "url": "https://example.com/articles/ART000040",
      "metadata": {
        "word_count": 65,
        "reading_time_minutes": 1,
        "has_images": true,
        "view_count": 9526
      }
    }
  ]
}